<!DOCTYPE html>
<!-- START: inst/pkgdown/templates/layout.html --><!-- Generated by pkgdown: do not edit by hand --><html lang="en"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="utf-8"><title>Library Carpentry Wikidata: Introduction to querying</title><meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" type="text/css" href="assets/styles.css"><script src="assets/scripts.js" type="text/javascript"></script><!-- mathjax --><script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      config: ["MMLorHTML.js"],
      jax: ["input/TeX","input/MathML","output/HTML-CSS","output/NativeMML", "output/PreviewHTML"],
      extensions: ["tex2jax.js","mml2jax.js","MathMenu.js","MathZoom.js", "fast-preview.js", "AssistiveMML.js", "a11y/accessibility-menu.js"],
      TeX: {
        extensions: ["AMSmath.js","AMSsymbols.js","noErrors.js","noUndefined.js"]
      },
      tex2jax: {
        inlineMath: [['\\(', '\\)']],
        displayMath: [ ['$$','$$'], ['\\[', '\\]'] ],
        processEscapes: true
      }
    });
    </script><script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js" integrity="sha256-nvJJv9wWKEm88qvoQl9ekL2J+k/RWIsaSScxxlsrv8k=" crossorigin="anonymous"></script><!-- Responsive Favicon for The Carpentries --><link rel="apple-touch-icon" sizes="180x180" href="apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="favicon-16x16.png"><link rel="manifest" href="site.webmanifest"><link rel="mask-icon" href="safari-pinned-tab.svg" color="#5bbad5"><meta name="msapplication-TileColor" content="#da532c"><meta name="theme-color" content="#ffffff"></head><body>
    <header id="top" class="navbar navbar-expand-md navbar-light bg-white top-nav library"><a class="visually-hidden-focusable skip-link" href="#main-content">Skip to main content</a>
  <div class="container-fluid top-nav-container">
    <div class="col-md-6">
      <div class="large-logo">
        <img alt="Library Carpentry" src="assets/images/library-logo.svg"><abbr class="badge badge-light" title="This lesson is in the beta phase, which means that it is ready for teaching by instructors outside of the original author team." style="background-color: #001483; border-radius: 5px">
          <a href="https://cdh.carpentries.org/the-lesson-life-cycle.html#polishing-beta-stage" class="external-link alert-link" style="color: #FFF7F1">
            <i aria-hidden="true" class="icon" data-feather="alert-circle" style="border-radius: 5px"></i>
            Beta
          </a>
          <span class="visually-hidden">This lesson is in the beta phase, which means that it is ready for teaching by instructors outside of the original author team.</span>
        </abbr>
        
      </div>
    </div>
    <div class="selector-container">
      
      
      <div class="dropdown">
        <button class="btn btn-secondary dropdown-toggle bordered-button" type="button" id="dropdownMenu1" data-bs-toggle="dropdown" aria-expanded="false">
          <i aria-hidden="true" class="icon" data-feather="eye"></i> Learner View <i data-feather="chevron-down"></i>
        </button>
        <ul class="dropdown-menu" aria-labelledby="dropdownMenu1"><li><button class="dropdown-item" type="button" onclick="window.location.href='instructor/05-intro_to_querying.html';">Instructor View</button></li>
        </ul></div>
    </div>
  </div>
  <hr></header><nav class="navbar navbar-expand-xl navbar-light bg-white bottom-nav library" aria-label="Main Navigation"><div class="container-fluid nav-container">
    <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle Navigation">
      <span class="navbar-toggler-icon"></span>
      <span class="menu-title">Menu</span>
    </button>
    <div class="nav-logo">
      <img class="small-logo" alt="Library Carpentry" src="assets/images/library-logo-sm.svg"></div>
    <div class="lesson-title-md">
      Library Carpentry Wikidata
    </div>
    <div class="search-icon-sm">
      <!-- TODO: do not show until we have search
        <i role="img" aria-label="Search the All In One page" data-feather="search"></i>
      -->
    </div>
    <div class="desktop-nav">
      <ul class="navbar-nav me-auto mb-2 mb-lg-0"><li class="nav-item">
          <span class="lesson-title">
            Library Carpentry Wikidata
          </span>
        </li>
        <li class="nav-item">
          <a class="nav-link" href="key-points.html">Key Points</a>
        </li>
        <li class="nav-item">
          <a class="nav-link" href="reference.html#glossary">Glossary</a>
        </li>
        <li class="nav-item">
          <a class="nav-link" href="profiles.html">Learner Profiles</a>
        </li>
        <li class="nav-item dropdown">
          <button class="nav-link dropdown-toggle" id="navbarDropdown" data-bs-toggle="dropdown" aria-expanded="false">
            More <i data-feather="chevron-down"></i>
          </button>
          <ul class="dropdown-menu" aria-labelledby="navbarDropdown"><li><a class="dropdown-item" href="discuss.html">Discussion</a></li><li><a class="dropdown-item" href="reference.html">FIXME</a></li>
          </ul></li>
      </ul></div>
    <!--
    <form class="d-flex col-md-2 search-form">
      <fieldset disabled>
      <input class="form-control me-2 searchbox" type="search" placeholder="" aria-label="">
        <button class="btn btn-outline-success tablet-search-button"  type="submit">
          <i class="search-icon" data-feather="search" role="img" aria-label="Search the All In One page"></i>
        </button>
      </fieldset>
    </form>
    -->
    <a class="btn btn-primary" href="aio.html" role="button" aria-label="Search the All In One page">Search the All In One page</a>
  </div><!--/div.container-fluid -->
</nav><div class="col-md-12 mobile-title">
  Library Carpentry Wikidata
</div>

<aside class="col-md-12 lesson-progress"><div style="width: 100%" class="percentage">
    100%
  </div>
  <div class="progress library">
    <div class="progress-bar library" role="progressbar" style="width: 100%" aria-valuenow="100" aria-label="Lesson Progress" aria-valuemin="0" aria-valuemax="100">
    </div>
  </div>
</aside><div class="container">
      <div class="row">
        <!-- START: inst/pkgdown/templates/navbar.html -->
<div id="sidebar-col" class="col-lg-4">
  <div id="sidebar" class="sidebar">
      <nav aria-labelledby="flush-headingEleven"><button role="button" aria-label="close menu" alt="close menu" aria-expanded="true" aria-controls="sidebar" class="collapse-toggle" data-collapse="Collapse " data-episodes="Episodes ">
          <i class="search-icon" data-feather="x" role="img"></i>
        </button>
        <div class="sidebar-inner">
          <div class="row mobile-row">
            <div class="col">
              <div class="sidenav-view-selector">
                <div class="accordion accordion-flush" id="accordionFlush9">
                  <div class="accordion-item">
                    <h2 class="accordion-header" id="flush-headingNine">
                      <button class="accordion-button collapsed" id="instructor" type="button" data-bs-toggle="collapse" data-bs-target="#flush-collapseNine" aria-expanded="false" aria-controls="flush-collapseNine">
                        <i id="eye" aria-hidden="true" class="icon" data-feather="eye"></i> Learner View
                      </button>
                    </h2>
                    <div id="flush-collapseNine" class="accordion-collapse collapse" aria-labelledby="flush-headingNine" data-bs-parent="#accordionFlush2">
                      <div class="accordion-body">
                        <a href="instructor/05-intro_to_querying.html">Instructor View</a>
                      </div>
                    </div>
                  </div><!--/div.accordion-item-->
                </div><!--/div.accordion-flush-->
              </div><!--div.sidenav-view-selector -->
            </div><!--/div.col -->
      
            <hr></div><!--/div.mobile-row -->

          <div class="accordion accordion-flush" id="accordionFlush11">
            <div class="accordion-item">

              <button id="chapters" class="accordion-button show" type="button" data-bs-toggle="collapse" data-bs-target="#flush-collapseEleven" aria-expanded="false" aria-controls="flush-collapseEleven">
                <h2 class="accordion-header chapters" id="flush-headingEleven">
                  EPISODES
                </h2>
              </button>
              <div id="flush-collapseEleven" class="accordion-collapse show collapse" aria-labelledby="flush-headingEleven" data-bs-parent="#accordionFlush11">

                <div class="accordion-body">
                  <div class="accordion accordion-flush" id="accordionFlush1">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading1">
        <a href="index.html">Summary and Setup</a>
    </div><!--/div.accordion-header-->
        
  </div><!--/div.accordion-item-->
</div><!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush2">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading2">
        <a href="01-introduction.html">1. What is Wikidata?</a>
    </div><!--/div.accordion-header-->
        
  </div><!--/div.accordion-item-->
</div><!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush3">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading3">
        <a href="02-Wikidata_underlying_concepts.html">2. Underlying concepts of Wikidata</a>
    </div><!--/div.accordion-header-->
        
  </div><!--/div.accordion-item-->
</div><!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush4">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading4">
        <a href="03-intro_to_editing.html">3. Introduction to editing</a>
    </div><!--/div.accordion-header-->
        
  </div><!--/div.accordion-item-->
</div><!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush5">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading5">
        <a href="04-advanced_editing.html">4. Advanced editing</a>
    </div><!--/div.accordion-header-->
        
  </div><!--/div.accordion-item-->
</div><!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlushcurrent">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-headingcurrent">
      <button class="accordion-button" type="button" data-bs-toggle="collapse" data-bs-target="#flush-collapsecurrent" aria-expanded="true" aria-controls="flush-collapsecurrent">
        <span class="visually-hidden">Current Chapter</span>
        <span class="current-chapter">
        5. Introduction to querying
        </span>
      </button>
    </div><!--/div.accordion-header-->
        
    <div id="flush-collapsecurrent" class="accordion-collapse collapse show" aria-labelledby="flush-headingcurrent" data-bs-parent="#accordionFlushcurrent">
      <div class="accordion-body">
        <ul><li><a href="#what-is-sparql">5.1 What is SPARQL?</a></li>
<li><a href="#wikidata-query-service">5.2 Wikidata Query Service</a></li>
<li><a href="#try-examples">5.3 Try examples</a></li>
<li><a href="#more-advanced-queries">5.4 More Advanced queries</a></li>
        </ul></div><!--/div.accordion-body-->
    </div><!--/div.accordion-collapse-->
        
  </div><!--/div.accordion-item-->
</div><!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush7">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading7">
        <a href="06-bulk_actions.html">6. Advanced bulk updating, bots</a>
    </div><!--/div.accordion-header-->
        
  </div><!--/div.accordion-item-->
</div><!--/div.accordion-flush-->

                </div>
              </div>
            </div>

            <hr class="half-width"><div class="accordion accordion-flush resources" id="accordionFlush12">
              <div class="accordion-item">
                <h2 class="accordion-header" id="flush-headingTwelve">
                  <button class="accordion-button collapsed" id="resources" type="button" data-bs-toggle="collapse" data-bs-target="#flush-collapseTwelve" aria-expanded="false" aria-controls="flush-collapseTwelve">
                    RESOURCES
                  </button>
                </h2>
                <div id="flush-collapseTwelve" class="accordion-collapse collapse" aria-labelledby="flush-headingTwelve" data-bs-parent="#accordionFlush12">
                  <div class="accordion-body">
                    <ul><li>
                        <a href="key-points.html">Key Points</a>
                      </li>
                      <li>
                        <a href="reference.html#glossary">Glossary</a>
                      </li>
                      <li>
                        <a href="profiles.html">Learner Profiles</a>
                      </li>
                      <li><a href="discuss.html">Discussion</a></li><li><a href="reference.html">FIXME</a></li>
                    </ul></div>
                </div>
              </div>
            </div>
            <hr class="half-width resources"><a href="aio.html">See all in one page</a>
            

            <hr class="d-none d-sm-block d-md-none"><div class="d-grid gap-1">
            
            </div>
          </div><!-- /div.accordion -->
        </div><!-- /div.sidebar-inner -->
      </nav></div><!-- /div.sidebar -->
  </div><!-- /div.sidebar-col -->
<!-- END:   inst/pkgdown/templates/navbar.html-->

        <!-- START: inst/pkgdown/templates/content-instructor.html -->
  <div class="col-xl-8 col-lg-12 primary-content">
    <nav class="lesson-content mx-md-4" aria-label="Previous and Next Chapter"><!-- content for small screens --><div class="d-block d-sm-block d-md-none">
        <a class="chapter-link" href="04-advanced_editing.html"><i aria-hidden="true" class="small-arrow" data-feather="arrow-left"></i>Previous</a>
        <a class="chapter-link float-end" href="06-bulk_actions.html">Next<i aria-hidden="true" class="small-arrow" data-feather="arrow-right"></i></a>
      </div>
      <!-- content for large screens -->
      <div class="d-none d-sm-none d-md-block">
        <a class="chapter-link" href="04-advanced_editing.html" rel="prev">
          <i aria-hidden="true" class="small-arrow" data-feather="arrow-left"></i>
          Previous: Advanced editing
        </a>
        <a class="chapter-link float-end" href="06-bulk_actions.html" rel="next">
          Next: Advanced bulk... 
          <i aria-hidden="true" class="small-arrow" data-feather="arrow-right"></i>
        </a>
      </div>
      <hr></nav><main id="main-content" class="main-content"><div class="container lesson-content">
        <h1>Introduction to querying</h1>
        <p>Last updated on 2024-02-19 |
        
        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/episodes/05-intro_to_querying.md" class="external-link">Edit this page <i aria-hidden="true" data-feather="edit"></i></a></p>
        
        
        
        <div class="text-end">
          <button role="button" aria-pressed="false" tabindex="0" id="expand-code" class="pull-right" data-expand="Expand All Solutions " data-collapse="Collapse All Solutions "> Expand All Solutions <i aria-hidden="true" data-feather="plus"></i></button>
        </div>

        

<div class="overview card">
<h2 class="card-header">Overview</h2>
<div class="row g-0">
<div class="col-md-4">
<div class="card-body">
<div class="inner">
<h3 class="card-title">Questions</h3>
<ul><li>What is SPARQL?</li>
<li>How to use SPARQL to query Wikidata?</li>
<li>How to use Wikidata querying tools?</li>
</ul></div>
</div>
</div>
<div class="col-md-8">
<div class="card-body">
<div class="inner bordered">
<h3 class="card-title">Objectives</h3>
<ul><li>Know what a query language is, and how SPARQL differs SQL.</li>
<li>Be able to use SPARQL to query Wikidata.</li>
<li>Potentially be able to use a tool like <a href="https://tools.wmflabs.org/tabernacle/#/" class="external-link">TABernacle</a> to edit
based on a query.</li>
<li>Have a cursory knowledge of the plethora of Wikidata querying tools
and how they can be used by librarians.</li>
<li>Know the purpose and usefulness of maintenance queries for
identifying missing information.</li>
<li>Be able to create maintenance queries.</li>
</ul></div>
</div>
</div>
</div>
</div>
<p>FIXME</p>
<p>There are different ways to query information in Wikidata. The
simplest way is to search for an entry in Wikidata and looking up all
information for that entry, e.g. <a href="https://www.wikidata.org/w/index.php?search=Richard+Feynman" class="external-link">search
for Richard Feynmann</a>. This search looks by default in the Q-pages as
well as the P-pages. However, we can restrict a search for a property by
only looking in the P-pages, e.g. if we want to look whether there is
property for the ISBN we can <a href="https://www.wikidata.org/w/index.php?search=isbn&amp;title=Special%3ASearch&amp;profile=advanced&amp;fulltext=1&amp;advancedSearch-current=%7B%22namespaces%22%3A%5B120%5D%7D&amp;ns120=1" class="external-link">restrict
that search to properties only</a>. Moreover, for a given entry there is
always the possibility to see other pages which links to that
(e.g. using it as an object), e.g. all pages linking to Richard Feynman:
<a href="https://www.wikidata.org/wiki/Special:WhatLinksHere/Q39246" class="external-link">https://www.wikidata.org/wiki/Special:WhatLinksHere/Q39246</a></p>
<p>That is not much different from other searches you may be familiar
with. However, the real potential of Wikidata as a huge knowledge graph,
can be experienced through more advanced querying with the Wikidata
query service where the queries have to entered in SPARQL.</p>
<p>% To discover Wikidata objects nearby there is the nearby search: %
<a href="https://www.wikidata.org/wiki/Special:Nearby" class="external-link">https://www.wikidata.org/wiki/Special:Nearby</a></p>
<section id="what-is-sparql"><h2 class="section-heading">5.1 What is SPARQL?<a class="anchor" aria-label="anchor" href="#what-is-sparql"></a>
</h2>
<hr class="half-width"><p>SPARQL is a query language for RDF data and is a W3C recommendations
since 2008. The data has to be stored as triples where the object of one
triple can be the subject of another triple. Thus, one can think about a
huge knowledge graph, where the nodes are connected by the predicates
with other nodes. For example here we see all the information about the
book “The Meaning of It All” from Wikidata as a graph:</p>
<p><img src="fig/Knowledge-Graph-Example-Meaning-of-it-All.png" alt="Example for the knowledge graph spanned by one Wikidata item" class="figure"> %
source: <a href="https://tinyurl.com/y267yz5q" class="external-link">http://tinyurl.com/y267yz5q</a></p>
<p>However, this is only the graph spanned by one item and its connected
entries, which then itself also have more connections, e.g. we can open
some links from the author Richard Feynman:</p>
<p><img src="fig/Knowledge-Graph-Example-Meaning-of-it-All-More.png" alt="Example for the knowledge graph spanned by one Wikidata item and more details about Feynman" class="figure">
% click on that node in the above query</p>
<p>For querying data now in this knowledge graph with SPARQL we define
some graph patterns which we want to search. The simplest form is a
triple where we replace one of the components with a variable, which is
indicated by a string starting with a question mark:</p>
<ul><li>Query for the publisher:
<code>{ wd:Q7750812 wdt:P123 ?publisher . }</code>
</li>
<li>Query for the connection:
<code>{ wd:Q7750812 ?property wd:Q353060 . }</code>
</li>
<li>Query for the publications from Addison-Wesley:
<code>{ ?book wdt:P123 wd:Q353060 . }</code>
</li>
</ul></section><section id="wikidata-query-service"><h2 class="section-heading">5.2 Wikidata Query Service<a class="anchor" aria-label="anchor" href="#wikidata-query-service"></a>
</h2>
<hr class="half-width"><p>The Wikidata query service can be found at <a href="https://query.wikidata.org/" class="external-link">https://query.wikidata.org/</a>.
There is the main window on the right to formulate your query in SPARQL.
On the left there is the query helper and at the bottom the result will
show up.</p>
<p>We will only cover here <code>SELECT</code>-statements and start by
typing</p>
<pre><code>SELECT * WHERE {

}</code></pre>
<p><em>Hint</em> It is enough to start typing “SELECT” and then use the
auto-completion with Ctrl+Space. % TODO what is this for on a Mac?</p>
<p>Inside the parenthesis you can then place the statements describing
the graph pattern you are looking for.</p>
<div id="exercise-your-first-sparql-query" class="callout discussion">
<div class="callout-square">
<i class="callout-icon" data-feather="message-circle"></i>
</div>
<div id="exercise-your-first-sparql-query" class="callout-inner">
<h3 class="callout-title">Exercise: Your first SPARQL query<a class="anchor" aria-label="anchor" href="#exercise-your-first-sparql-query"></a>
</h3>
<div class="callout-content">
<p>Write your first SPARQL query for the publisher of the above
mentioned book by copying the part from above point inside a
SELECT-statement.</p>
</div>
</div>
</div>
<div id="accordionSolution1" class="accordion challenge-accordion accordion-flush">
<div class="accordion-item">
<button class="accordion-button solution-button collapsed" type="button" data-bs-toggle="collapse" data-bs-target="#collapseSolution1" aria-expanded="false" aria-controls="collapseSolution1">
  <h4 class="accordion-header" id="headingSolution1">Show me the solution</h4>
</button>
<div id="collapseSolution1" class="accordion-collapse collapse" data-bs-parent="#accordionSolution1" aria-labelledby="headingSolution1">
<div class="accordion-body">
<pre><code>SELECT * WHERE {
   wd:Q7750812 wdt:P123 ?publisher .
}</code></pre>
</div>
</div>
</div>
</div>
<div class="section level3">
<h3 id="showing-labels-to-q-numbers">Showing labels to Q-numbers<a class="anchor" aria-label="anchor" href="#showing-labels-to-q-numbers"></a></h3>
</div>
<div class="section level3">
<h3 id="namespaces-and-prefixes">Namespaces and Prefixes<a class="anchor" aria-label="anchor" href="#namespaces-and-prefixes"></a></h3>
<p>Prefixes are short abbrevations in the Wikidata Query Service. Some
prefixes in Wikidata are: wd, wdt, p, ps, bd, etc.</p>
<p>Example:</p>
<pre><code>SELECT ?item ?itemLabel 
WHERE 
{
  ?item wdt:P50 wd:Q23434.
  SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}</code></pre>
<p>Items should be prefixed with wd: and properties with wdt: .</p>
<p>Namespaces in Wikidata are:</p>
<ul><li>Main namespace</li>
<li>Property</li>
<li>Wikidata: it is for information and discussions about Wikidata
itself. etc.</li>
</ul></div>
<div class="section level3">
<h3 id="more-conditions">More conditions<a class="anchor" aria-label="anchor" href="#more-conditions"></a></h3>
<ul><li>publications from Addison-Wesley vs. books from Addison-Wesley
vs. books authored by Richard Feynman from Addison-Wesley</li>
<li>LIMIT</li>
<li>ORDER</li>
<li>FILTER</li>
<li>OPTIONAL ### How to visualize your query #### Manual visualization
in the results window:</li>
</ul><p>Start by opening the results window. In the results pane, click the
“Table” button and choose the type of visualization you want. This way,
you can try different ways of visualizing your data without having to
change the query code.</p>
<figure><img src="fig/episode_5_table.jpg" alt="Wikidata Query Service results window" class="figure mx-auto d-block"></figure><div class="section level4">
<h4 id="automated-visualization-with-defaultview">Automated visualization with #defaultView:<a class="anchor" aria-label="anchor" href="#automated-visualization-with-defaultview"></a></h4>
<p>For an easy start, add the #defaultView: snippet at the beginning of
your query. This method ensures that your results will be automatically
visualized in a predefined style. This will save you time without having
to manually adjust the result window after each query. This method is
useful for queries where you already know which visualization types you
want to use.</p>
<p><img src="fig/episode_5_defaultview.png" alt="Extract from the SPARQL editor" class="figure"> ### Exercises</p>
</div>
</div>
</section><section id="try-examples"><h2 class="section-heading">5.3 Try examples<a class="anchor" aria-label="anchor" href="#try-examples"></a>
</h2>
<hr class="half-width"><div class="section level4">
<h4 id="enough-theory-its-time-to-get-hands-on--lets-start-with-a-simple-example--literally-everyone-likes-cats-right-so-lets-search-for-them-in-the-wikidata-database-">Enough theory! it’s time to get hands-on. Let’s start with a simple
example. Literally everyone likes cats, right? So lets search for them
in the Wikidata database.<a class="anchor" aria-label="anchor" href="#enough-theory-its-time-to-get-hands-on--lets-start-with-a-simple-example--literally-everyone-likes-cats-right-so-lets-search-for-them-in-the-wikidata-database-"></a></h4>
<p><strong>Cats example</strong></p>
<pre><code>SELECT ?item ?itemLabel 
WHERE 
{
  ?item wdt:P31 wd:Q146. # Must be of a cat
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". } # Helps get the label in your language, if not, then en language
}</code></pre>
<p>alright! so we found the all the Cats. But i am pretty sure that i
have seen Pictures of Cats somewhere in Wikipedia or Wikidata. Is there
a possiblity to display Pictures in the wikidata Query Serivice? The
simple Answer yes! Let me show you how it is done.</p>
<p><strong>Cats pictures</strong></p>
<p>In the first step we searched for cats. It is also possible to search
for images in Wikidata if they are available. The Wikidata Query Service
offers a range of visualization types. For the representation of images
the image grid is suitable.</p>
<pre><code>#defaultView:ImageGrid
#Normally, the default output is a table, but with the defaultView we can directly specify that the results should be displayed in a grid

SELECT ?item ?itemLabel ?itemPic
#Show me the item, label and the picture of it
#The result list will look like this (wd:Q123185365/senior cats/ commons:Оредеж, Железнодорожная 9, кот (cropped).jpg)

WHERE
{
  ?item wdt:P31 wd:Q146.       #The item of this search is a cat
  ?item wdt:P18 ?itemPic.      #Show me only cats with pictures. If you want to include very cats in your search, you need to place the Option{} function in front

SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
#Helps to get the label in English. If not, yours will be selected automatically
}
</code></pre>
<figure><img src="fig/episode_5_Imagegrid.jpg" alt="Example of displaying cats in grid format" class="figure mx-auto d-block"></figure><p>Wow that was quit a lot of Code, hasnt it. lets break it down so you
understand the synatx better.</p>
<p>Lets move on to another example</p>
<p><strong>Worldmap of libraries</strong></p>
<pre><code>#defaultView:Map
#Display the results as a Map

SELECT distinct *
#Display all available geographic coordinates

WHERE {

  ?item wdt:P31 wd:Q7075;     #Define the item as a library ";"(and) define the geographic coordinates of item as ?geo
        wdt:P625 ?geo.           

}</code></pre>
<figure><img src="fig/episode_5_Map_WorldWide.png" alt="Extract from the SPARQL editor" class="figure mx-auto d-block"></figure><p><strong>Map of libraries in the USA</strong></p>
<pre><code>#defaultView:Map
#Display the results as a Map


SELECT ?itemLabel ?geo
#Display the label and the geographical coordinates of the item

WHERE {

  ?item wdt:P31 wd:Q7075.     #Define the item as a library
  ?item wdt:P625 ?geo.        #bind the geographic coordinates as ?geo
  ?item wdt:P17 ?country.     #bind the country of item as ?country

  FILTER(?country = wd:Q30)   #Use Filter to set Country to wd:Q30(U.S.A)


  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
  #Helps to get the label in English. If not, yours will be selected automatically
}</code></pre>
<figure><img src="fig/episode_5_Map_USA.png" alt="Extract from the SPARQL editor" class="figure mx-auto d-block"></figure><p><strong>Count of libraries per Country</strong></p>
<pre><code>#defaultView:BarChart
#Display the results as a Bar Chart

SELECT distinct ?country ?countryLabel (COUNT(?item) as ?Count)
#Show me the g

WHERE {
  ?item wdt:P31 wd:Q7075;  #Define the item as a library ";"(and) define the country of item as ?country
        wdt:P17 ?country.  


 SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
 #Helps to get the label in English. If not, yours will be selected automatically

}
Group by ?geo ?geoLabel
#Aggregate with the group function

Order by DESC(?Count)
#Order result list by variable ?count in descending order

LIMIT 10
#Limit the shown results down to 10.
</code></pre>
<figure><img src="fig/episode_5_Bar_Countries.png" alt="Extract from the SPARQL editor" class="figure mx-auto d-block"></figure><p><strong>Books weight by genre</strong> Number of available books
weighted by genre.</p>
<pre><code>#defaultView:BubbleChart
#Display the results as a Bubble Chart

SELECT ?genre ?genreLabel  (COUNT(?book) as ?bookCount)
#Show me the genre, the genre label, and count the available books as a new label ?bookCount
#The result list will look like this (wd:Q213051/Non-Fiction/252)

WHERE
{
  ?book wdt:P31 wd:Q571.            #Searched item is a book
  ?book wdt:P136 ?genre.            #Get the attribute genre form item

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
  #Helps to get the label in English. If not, yours will be selected automatically
}

GROUP BY ?genre ?genreLabel
#Aggregate with the group function
 
LIMIT 15
#Limit the shown results down to 15.</code></pre>
<figure><img src="fig/episode_5_Bubble.png" alt="Bubblechart of books weight by genre" class="figure mx-auto d-block"></figure><p><strong>Map of NFDI Consortia in Germany</strong></p>
<pre><code>#defaultView:Map
#Display the results as a Map

SELECT DISTINCT ?affiliateLabel ?affiliatepicture ?coordinates ?NFDILabel (?NFDILabel AS ?layer)
#Show me the label, image, and coordinates of the affiliate parties.
#Show me the NFDI label as well, using the NFDILabel as a layer filter.
#The layer filter lets you choose which NFDI to display on the map.
#The result list will look like this (Deutsche Nationalbibliothek/commons:DNB.svg/NFDI4Culture/Point(8.683333333 50.131111111))

WHERE 
{
  ?NFDI wdt:P31 wd:Q98270496.       #Searched item is an accepted NFDI
  ?NFDI wdt:P1416 ?affiliate.       #Get the affiliates of the accepted NFDI.
  ?affiliate wdt:P625 ?coordinates. #Get the coordinates of the affiliate parties

  OPTIONAL { ?affiliate wdt:P17 ?country }           #Get attribute country if available
  OPTIONAL { ?affiliate wdt:P154 ?affiliatepicture } #Get attribute picture if available

  FILTER(?country = wd:Q183)        #Use Filter to set country to wd:Q183(Germany)
 

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]" . }
  #Helps to get the label in English. If not, yours will be selected automatically
}</code></pre>
<figure><img src="fig/episode_05_Map.jpg" alt="Map of NFDI Consortia in Germany" class="figure mx-auto d-block"></figure><figure><img src="fig/episode_05_Map_CloseUp.png" alt="Close up look" class="figure mx-auto d-block"></figure><p><strong>Number of participants in NFDI consortia</strong></p>
<pre><code>#Number of participants in NFDI consortia
#defaultView:BarChart
#Use the bar chart as the visualization type and give me the results immediately in the form of a bar chart.

SELECT DISTINCT ?NFDIKLabel  (COUNT(DISTINCT ?participants ) as ?participantsCount)
#Give me the unique (no double entries) names of the accepted NFDIK consortia.
#Count the participants using the COUNT function and return the number of participants as a new variable ?participantsCount.   


WHERE
{
  ?NFDIK wdt:P31 wd:Q98270496.       #Give me all accepted NFDI consortia.
  ?NFDIK wdt:P710 ?participants.     #Show me the all participants of this NFDI consortium.

#Attention: Not all consortia are listed here, but only those that have an entry participants in Wikidata.
#Participants can be researchers, research institutions, universities, companies and many more.

SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]" . }
#Helps to get the label in English. If not, yours will be selected automatically
}

GROUP BY ?NFDIKLabel
#Group by NFDIK

HAVING (?participantsCount &gt; 4)
#Show me only NFDI consortia that have more than four registered participants.
</code></pre>
<figure><img src="fig/episode_05_Barchart.png" alt="Number of participants in NFDI consortia visualized as bar chart" class="figure mx-auto d-block"></figure><p><strong>NFDI Consortia in Berlin, Germany</strong></p>
<pre><code>#defaultView:Graph
#Use the graph as the visualization type


SELECT ?affiliate ?affiliateLabel ?affiliatepicture ?NFDIK ?NFDIKLabel ?NFDIKpicture
#Give me the label and the pictures of the affiliated parties of the accepted consortia of the NFDIK.
#Give me label and pictures of accepted NFDIK consortia.


WHERE
{
  ?NFDIK wdt:P31 wd:Q98270496.       #Get me all accepted NFDI consortia.
  ?NFDIK wdt:P1416 ?affiliate.       #Get the affiliates of the accepted NFDI.
  ?affiliate wdt:P131 ?location.     #Provide me with the location of the affiliated parties.

  
  FILTER(?location = wd:Q64)         #Set the location to Berlin.
  
   OPTIONAL { ?affiliate wdt:P154 ?affiliatepicture }  #Give me the pictures of the affilated partner, if available. 
   OPTIONAL { ?NFDIK wdt:P154 ?NFDIKpicture }          #Give me the pictures of the NFDI, if available.

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]" . }
  #Helps to get the label in English. If not, yours will be selected automatically

} 

</code></pre>
<figure><img src="fig/episode_5_Graph.png" alt="relationships between NFDI Consortia in Berlin, Germany" class="figure mx-auto d-block"></figure><p><strong>scholarly articles by Alex Bateman</strong></p>
<pre><code>SELECT ?item ?itemLabel ?journalLabel
WHERE 
{
  ?item wdt:P31 wd:Q13442814.
  ?item wdt:P50 wd:Q18921408.
  ?item wdt:P1433 ?journal.
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
}</code></pre>
<p><strong>Russian poets</strong></p>
<pre><code>SELECT ?item ?itemLabel ?place ?placeLabel ?coord
WHERE 
{
  ?item wdt:P31 wd:Q5.
  ?item wdt:P106 wd:Q49757.
  ?item wdt:P19 ?place.
  ?place wdt:P17 wd:Q159.
  ?place wdt:P625 ?coord
  
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
}</code></pre>
<p><strong>chemicals example</strong></p>
<pre><code>SELECT ?item ?itemLabel WHERE {
  
  ?item wdt:P31 wd:Q11173, wd:Q12140.
  
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
}</code></pre>
<pre><code>SELECT ?item ?itemLabel ?struc ?formula

WHERE {
  
  ?item wdt:P31 wd:Q11173, wd:Q12140.
  ?item wdt:P117 ?struc.
  ?item wdt:P274 ?formula
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
  
}</code></pre>
<pre><code>SELECT ?item ?itemLabel ?formula ?mass ?struc

WHERE {
  
  ?item wdt:P31 wd:Q11173, wd:Q12140.
  ?item wdt:P117 ?struc.
  ?item wdt:P274 ?formula.
  ?item wdt:P2067 ?mass.
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
  
}

ORDER BY DESC(?mass)
LIMIT 10</code></pre>
<p><strong>People born in Berlin filtered by year 1970</strong></p>
<pre><code>SELECT ?item ?itemLabel ?dob
WHERE 
{
  ?item wdt:P31 wd:Q5.
  ?item wdt:P19 wd:Q64.
  ?item wdt:P569 ?dob.
  
  FILTER(YEAR(?dob) = 1970)
  
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
}</code></pre>
</div>
</section><section id="more-advanced-queries"><h2 class="section-heading">5.4 More Advanced queries<a class="anchor" aria-label="anchor" href="#more-advanced-queries"></a>
</h2>
<hr class="half-width"><p>further links</p>
<pre><code>https://commons.wikimedia.org/wiki/File:Wikidata_Query_Service_in_Brief.pdf
https://www.uni-mannheim.de/media/Einrichtungen/dws/Files_Teaching/Semantic_Web_Technologies/SWT05-SPARQL-v1.pdf
https://www.wikidata.org/wiki/Wikidata:SPARQL_tutorial</code></pre>
<div id="keypoints1" class="callout keypoints">
<div class="callout-square">
<i class="callout-icon" data-feather="key"></i>
</div>
<div class="callout-inner">
<h3 class="callout-title">Key Points<a class="anchor" aria-label="anchor" href="#keypoints1"></a>
</h3>
<div class="callout-content">
<ul><li>First key point. (FIXME)</li>
</ul></div>
</div>
</div>
</section></div> <!-- / div.lesson-content -->
    </main><!-- / main#main-content.main-content --><nav class="bottom-pagination mx-md-4" aria-label="Previous and Next Chapter"><div class="d-block d-sm-block d-md-none">
        <a class="chapter-link" href="04-advanced_editing.html"><i aria-hidden="true" class="small-arrow" data-feather="arrow-left"></i>Previous</a>
        <a class="chapter-link float-end" href="06-bulk_actions.html">Next<i aria-hidden="true" class="small-arrow" data-feather="arrow-right"></i></a>
      </div>
      <!-- content for large screens -->
      <div class="d-none d-sm-none d-md-block">
        <a class="chapter-link" href="04-advanced_editing.html" rel="prev">
          <i aria-hidden="true" class="small-arrow" data-feather="arrow-left"></i>
          Previous: Advanced editing
        </a>
        <a class="chapter-link float-end" href="06-bulk_actions.html" rel="next">
          Next: Advanced bulk... 
          <i aria-hidden="true" class="small-arrow" data-feather="arrow-right"></i>
        </a>
      </div>
    </nav></div> <!-- / div.primary-content.col-xs-12 -->
<!-- END:   inst/pkgdown/templates/content-instructor.html-->

      </div><!--/div.row-->
      		<footer class="row footer mx-md-3"><hr><div class="col-md-6">
        <p>This lesson is subject to the <a href="CODE_OF_CONDUCT.html">Code of Conduct</a></p>
        <p>
        
        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/episodes/05-intro_to_querying.md" class="external-link">Edit on GitHub</a>
        
	
        | <a href="https://github.com/librarycarpentry/lc-wikidata/blob/main/CONTRIBUTING.md" class="external-link">Contributing</a>
        | <a href="https://github.com/librarycarpentry/lc-wikidata/" class="external-link">Source</a></p>
				<p><a href="https://github.com/librarycarpentry/lc-wikidata/blob/main/CITATION" class="external-link">Cite</a> | <a href="mailto:team@carpentries.org">Contact</a> | <a href="https://carpentries.org/about/" class="external-link">About</a></p>
			</div>
			<div class="col-md-6">
        
        <p>Materials licensed under <a href="LICENSE.html">CC-BY 4.0</a> by the authors</p>
        
        <p>Template licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/" class="external-link">CC-BY 4.0</a> by <a href="https://carpentries.org/" class="external-link">The Carpentries</a></p>
        <p>Built with <a href="https://github.com/carpentries/sandpaper/tree/0.16.4" class="external-link">sandpaper (0.16.4)</a>, <a href="https://github.com/carpentries/pegboard/tree/0.7.5" class="external-link">pegboard (0.7.5)</a>, and <a href="https://github.com/carpentries/varnish/tree/1.0.2" class="external-link">varnish (1.0.2)</a></p>
			</div>
		</footer></div> <!-- / div.container -->
	<div id="to-top">
		<a href="#top">
      <i class="search-icon" data-feather="arrow-up" role="img" aria-label="Back To Top"></i><br><!-- <span class="d-none d-sm-none d-md-none d-lg-none d-xl-block">Back</span> To Top --><span class="d-none d-sm-none d-md-none d-lg-none d-xl-block">Back</span> To Top
		</a>
	</div>
  <script type="application/ld+json">
    {
  "@context": "https://schema.org",
  "@type": "TrainingMaterial",
  "@id": "https://librarycarpentry.github.io/lc-wikidata/05-intro_to_querying.html",
  "inLanguage": "en",
  "dct:conformsTo": "https://bioschemas.org/profiles/TrainingMaterial/1.0-RELEASE",
  "description": "A Carpentries Lesson teaching foundational data and coding skills to researchers worldwide",
  "keywords": "software, data, lesson, The Carpentries",
  "name": "Introduction to querying",
  "creativeWorkStatus": "active",
  "url": "https://librarycarpentry.github.io/lc-wikidata/05-intro_to_querying.html",
  "identifier": "https://librarycarpentry.github.io/lc-wikidata/05-intro_to_querying.html",
  "dateCreated": "2018-09-17",
  "dateModified": "2024-02-19",
  "datePublished": "2024-06-18"
}

  </script><script>
		feather.replace();
	</script><!-- Matomo
    2022-11-07: we have gotten a notification that we have an overage for our
    tracking and I'm pretty sure this has to do with Workbench usage.
    Considering that I am not _currently_ using this tracking because I do not
    yet know how to access the data, I am turning this off for now.
  <script>
    var _paq = window._paq = window._paq || [];
    /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
    _paq.push(["setDocumentTitle", document.domain + "/" + document.title]);
    _paq.push(["setDomains", ["*.preview.carpentries.org","*.datacarpentry.github.io","*.datacarpentry.org","*.librarycarpentry.github.io","*.librarycarpentry.org","*.swcarpentry.github.io", "*.carpentries.github.io"]]);
    _paq.push(["setDoNotTrack", true]);
    _paq.push(["disableCookies"]);
    _paq.push(['trackPageView']);
    _paq.push(['enableLinkTracking']);
    (function() {
          var u="https://carpentries.matomo.cloud/";
          _paq.push(['setTrackerUrl', u+'matomo.php']);
          _paq.push(['setSiteId', '1']);
          var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
          g.async=true; g.src='https://cdn.matomo.cloud/carpentries.matomo.cloud/matomo.js'; s.parentNode.insertBefore(g,s);
        })();
  </script>
  End Matomo Code --></body></html><!-- END:   inst/pkgdown/templates/layout.html-->

