<!DOCTYPE html>
<!-- START: inst/pkgdown/templates/layout.html --><!-- Generated by pkgdown: do not edit by hand --><html lang="en" data-bs-theme="auto">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta charset="utf-8">
<title>Library Carpentry Wikidata: All in One View</title>
<meta name="viewport" content="width=device-width, initial-scale=1">
<script src="../assets/themetoggle.js"></script><link rel="stylesheet" type="text/css" href="../assets/styles.css">
<script src="../assets/scripts.js" type="text/javascript"></script><!-- mathjax --><script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      config: ["MMLorHTML.js"],
      jax: ["input/TeX","input/MathML","output/HTML-CSS","output/NativeMML", "output/PreviewHTML"],
      extensions: ["tex2jax.js","mml2jax.js","MathMenu.js","MathZoom.js", "fast-preview.js", "AssistiveMML.js", "a11y/accessibility-menu.js"],
      TeX: {
        extensions: ["AMSmath.js","AMSsymbols.js","noErrors.js","noUndefined.js"]
      },
      tex2jax: {
        inlineMath: [['\\(', '\\)']],
        displayMath: [ ['$$','$$'], ['\\[', '\\]'] ],
        processEscapes: true
      }
    });
    </script><script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js" integrity="sha256-nvJJv9wWKEm88qvoQl9ekL2J+k/RWIsaSScxxlsrv8k=" crossorigin="anonymous"></script><!-- Responsive Favicon for The Carpentries --><link rel="apple-touch-icon" sizes="180x180" href="../favicons/lc/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="../favicons/lc/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="../favicons/lc/favicon-16x16.png">
<link rel="manifest" href="../favicons/lc/site.webmanifest">
<link rel="mask-icon" href="../favicons/lc/safari-pinned-tab.svg" color="#5bbad5">
<meta name="msapplication-TileColor" content="#da532c">
<meta name="theme-color" media="(prefers-color-scheme: light)" content="white">
<meta name="theme-color" media="(prefers-color-scheme: dark)" content="black">
</head>
<body>
    <header id="top" class="navbar navbar-expand-md top-nav library"><svg xmlns="http://www.w3.org/2000/svg" class="d-none"><symbol id="check2" viewbox="0 0 16 16"><path d="M13.854 3.646a.5.5 0 0 1 0 .708l-7 7a.5.5 0 0 1-.708 0l-3.5-3.5a.5.5 0 1 1 .708-.708L6.5 10.293l6.646-6.647a.5.5 0 0 1 .708 0z"></path></symbol><symbol id="circle-half" viewbox="0 0 16 16"><path d="M8 15A7 7 0 1 0 8 1v14zm0 1A8 8 0 1 1 8 0a8 8 0 0 1 0 16z"></path></symbol><symbol id="moon-stars-fill" viewbox="0 0 16 16"><path d="M6 .278a.768.768 0 0 1 .08.858 7.208 7.208 0 0 0-.878 3.46c0 4.021 3.278 7.277 7.318 7.277.527 0 1.04-.055 1.533-.16a.787.787 0 0 1 .81.316.733.733 0 0 1-.031.893A8.349 8.349 0 0 1 8.344 16C3.734 16 0 12.286 0 7.71 0 4.266 2.114 1.312 5.124.06A.752.752 0 0 1 6 .278z"></path><path d="M10.794 3.148a.217.217 0 0 1 .412 0l.387 1.162c.173.518.579.924 1.097 1.097l1.162.387a.217.217 0 0 1 0 .412l-1.162.387a1.734 1.734 0 0 0-1.097 1.097l-.387 1.162a.217.217 0 0 1-.412 0l-.387-1.162A1.734 1.734 0 0 0 9.31 6.593l-1.162-.387a.217.217 0 0 1 0-.412l1.162-.387a1.734 1.734 0 0 0 1.097-1.097l.387-1.162zM13.863.099a.145.145 0 0 1 .274 0l.258.774c.115.346.386.617.732.732l.774.258a.145.145 0 0 1 0 .274l-.774.258a1.156 1.156 0 0 0-.732.732l-.258.774a.145.145 0 0 1-.274 0l-.258-.774a1.156 1.156 0 0 0-.732-.732l-.774-.258a.145.145 0 0 1 0-.274l.774-.258c.346-.115.617-.386.732-.732L13.863.1z"></path></symbol><symbol id="sun-fill" viewbox="0 0 16 16"><path d="M8 12a4 4 0 1 0 0-8 4 4 0 0 0 0 8zM8 0a.5.5 0 0 1 .5.5v2a.5.5 0 0 1-1 0v-2A.5.5 0 0 1 8 0zm0 13a.5.5 0 0 1 .5.5v2a.5.5 0 0 1-1 0v-2A.5.5 0 0 1 8 13zm8-5a.5.5 0 0 1-.5.5h-2a.5.5 0 0 1 0-1h2a.5.5 0 0 1 .5.5zM3 8a.5.5 0 0 1-.5.5h-2a.5.5 0 0 1 0-1h2A.5.5 0 0 1 3 8zm10.657-5.657a.5.5 0 0 1 0 .707l-1.414 1.415a.5.5 0 1 1-.707-.708l1.414-1.414a.5.5 0 0 1 .707 0zm-9.193 9.193a.5.5 0 0 1 0 .707L3.05 13.657a.5.5 0 0 1-.707-.707l1.414-1.414a.5.5 0 0 1 .707 0zm9.193 2.121a.5.5 0 0 1-.707 0l-1.414-1.414a.5.5 0 0 1 .707-.707l1.414 1.414a.5.5 0 0 1 0 .707zM4.464 4.465a.5.5 0 0 1-.707 0L2.343 3.05a.5.5 0 1 1 .707-.707l1.414 1.414a.5.5 0 0 1 0 .708z"></path></symbol></svg><a class="visually-hidden-focusable skip-link" href="#main-content">Skip to main content</a>
  <div class="container-fluid top-nav-container">
    <div class="col-md-8">
      <div class="large-logo">
        <img id="lc-logo" alt="Library Carpentry" src="../assets/images/library-logo.svg"><span class="badge text-bg-warning">
          <abbr title="This lesson is in the alpha phase, which means that it has been taught once and lesson authors are iterating on feedback.">
            <a href="https://docs.carpentries.org/resources/curriculum/lesson-life-cycle.html" class="external-link alert-link">
              <i aria-hidden="true" class="icon" data-feather="alert-triangle" style="border-radius: 5px"></i>
              Alpha
            </a>
            <span class="visually-hidden">This lesson is in the alpha phase, which means that it has been taught once and lesson authors are iterating on feedback.</span>
          </abbr>
        </span>

      </div>
    </div>
    <div class="selector-container">
      <div id="theme-selector">
        <li class="nav-item dropdown" id="theme-button-list">
          <button class="btn btn-link nav-link px-0 px-lg-2 dropdown-toggle d-flex align-items-center" id="bd-theme" type="button" aria-expanded="false" data-bs-toggle="dropdown" data-bs-display="static" aria-label="Toggle theme (auto)">
            <svg class="bi my-1 theme-icon-active"><use href="#circle-half"></use></svg><i data-feather="chevron-down"></i>
          </button>
          <ul class="dropdown-menu dropdown-menu-end" aria-labelledby="bd-theme-text">
<li>
              <button type="button" class="btn dropdown-item d-flex align-items-center" data-bs-theme-value="light" aria-pressed="false">
                <svg class="bi me-2 theme-icon"><use href="#sun-fill"></use></svg>
                Light
                <svg class="bi ms-auto d-none"><use href="#check2"></use></svg></button>
            </li>
            <li>
              <button type="button" class="btn dropdown-item d-flex align-items-center" data-bs-theme-value="dark" aria-pressed="false">
                <svg class="bi me-2 theme-icon"><use href="#moon-stars-fill"></use></svg>
                Dark
                <svg class="bi ms-auto d-none"><use href="#check2"></use></svg></button>
            </li>
            <li>
              <button type="button" class="btn dropdown-item d-flex align-items-center active" data-bs-theme-value="auto" aria-pressed="true">
                <svg class="bi me-2 theme-icon"><use href="#circle-half"></use></svg>
                Auto
                <svg class="bi ms-auto d-none"><use href="#check2"></use></svg></button>
            </li>
          </ul>
</li>
      </div>

      <div class="dropdown" id="instructor-dropdown">
        <button class="btn btn-secondary dropdown-toggle bordered-button" type="button" id="dropdownMenu1" data-bs-toggle="dropdown" aria-expanded="false">
          <i aria-hidden="true" class="icon" data-feather="eye"></i> Instructor View <i data-feather="chevron-down"></i>
        </button>
        <ul class="dropdown-menu" aria-labelledby="dropdownMenu1">
<li><button class="dropdown-item" type="button" onclick="window.location.href='../aio.html';">Learner View</button></li>
        </ul>
</div>
    </div>
  </div>
  <hr></header><nav class="navbar navbar-expand-xl bottom-nav library" aria-label="Main Navigation"><div class="container-fluid nav-container">
    <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle Navigation">
      <span class="navbar-toggler-icon"></span>
      <span class="menu-title">Menu</span>
    </button>
    <div class="nav-logo">
      <img class="small-logo" alt="Library Carpentry" src="../assets/images/library-logo-sm.svg">
</div>
    <div class="lesson-title-md">
      Library Carpentry Wikidata
    </div>
    <div class="search-icon-sm">
      <!-- TODO: do not show until we have search
        <i role="img" aria-label="Search the All In One page" data-feather="search"></i>
      -->
    </div>
    <div class="desktop-nav">
      <ul class="navbar-nav me-auto mb-2 mb-lg-0">
<li class="nav-item">
          <span class="lesson-title">
            Library Carpentry Wikidata
          </span>
        </li>
        <li class="nav-item">
          <a class="nav-link" href="../instructor/key-points.html">Key Points</a>
        </li>
        <li class="nav-item">
          <a class="nav-link" href="../instructor/instructor-notes.html">Instructor Notes</a>
        </li>
        <li class="nav-item">
          <a class="nav-link" href="../instructor/images.html">Extract All Images</a>
        </li>
        <li class="nav-item dropdown">
          <button class="nav-link dropdown-toggle" id="navbarDropdown" data-bs-toggle="dropdown" aria-expanded="false">
            More <i data-feather="chevron-down"></i>
          </button>
          <ul class="dropdown-menu" aria-labelledby="navbarDropdown">
<li><a class="dropdown-item" href="design.html">Lesson Design</a></li>
<hr>
<li><a class="dropdown-item" href="discuss.html">Discussion</a></li>
<li><a class="dropdown-item" href="reference.html">FIXME</a></li>
          </ul>
</li>
      </ul>
</div>
    <!--
    <form class="d-flex col-md-2 search-form">
      <fieldset disabled>
      <input class="form-control me-2 searchbox" type="search" placeholder="" aria-label="">
        <button class="btn btn-outline-success tablet-search-button"  type="submit">
          <i class="search-icon" data-feather="search" role="img" aria-label="Search the All In One page"></i>
        </button>
      </fieldset>
    </form>
    -->
    <a id="search-button" class="btn btn-primary" href="../instructor/aio.html" role="button" aria-label="Search the All In One page">Search the All In One page</a>
  </div>
<!--/div.container-fluid -->
</nav><div class="col-md-12 mobile-title">
  Library Carpentry Wikidata
</div>

<aside class="col-md-12 lesson-progress"><div style="width: %" class="percentage">
    %
  </div>
  <div class="progress library">
    <div class="progress-bar library" role="progressbar" style="width: %" aria-valuenow="" aria-label="Lesson Progress" aria-valuemin="0" aria-valuemax="100">
    </div>
  </div>
</aside><div class="container">
      <div class="row">
        <!-- START: inst/pkgdown/templates/navbar.html -->
<div id="sidebar-col" class="col-lg-4">
  <div id="sidebar" class="sidebar">
      <nav aria-labelledby="flush-headingEleven"><button role="button" aria-label="close menu" alt="close menu" aria-expanded="true" aria-controls="sidebar" class="collapse-toggle" data-collapse="Collapse " data-episodes="Episodes ">
          <i class="search-icon" data-feather="x" role="img"></i>
        </button>
        <div class="sidebar-inner">
          <div class="row mobile-row" id="theme-row-mobile">
            <div class="col" id="theme-selector">
              <li class="nav-item dropdown" id="theme-button-list">
                <button class="btn btn-link nav-link px-0 px-lg-2 dropdown-toggle d-flex align-items-center" id="bd-theme" type="button" aria-expanded="false" data-bs-toggle="dropdown" data-bs-display="static" aria-label="Toggle theme (auto)">
                  <svg class="bi my-1 theme-icon-active"><use href="#circle-half"></use></svg><span class="d-lg-none ms-1" id="bd-theme-text">Toggle Theme</span>
                </button>
                <ul class="dropdown-menu dropdown-menu-right" aria-labelledby="bd-theme-text">
<li>
                    <button type="button" class="btn dropdown-item d-flex align-items-center" data-bs-theme-value="light" aria-pressed="false">
                      <svg class="bi me-2 theme-icon"><use href="#sun-fill"></use></svg>
                      Light
                      <svg class="bi ms-auto d-none"><use href="#check2"></use></svg></button>
                  </li>
                  <li>
                    <button type="button" class="btn dropdown-item d-flex align-items-center" data-bs-theme-value="dark" aria-pressed="false">
                      <svg class="bi me-2 theme-icon"><use href="#moon-stars-fill"></use></svg>
                      Dark
                      <svg class="bi ms-auto d-none"><use href="#check2"></use></svg></button>
                  </li>
                  <li>
                    <button type="button" class="btn dropdown-item d-flex align-items-center active" data-bs-theme-value="auto" aria-pressed="true">
                      <svg class="bi me-2 theme-icon"><use href="#circle-half"></use></svg>
                      Auto
                      <svg class="bi ms-auto d-none"><use href="#check2"></use></svg></button>
                  </li>
                </ul>
</li>
            </div>
          </div>
          <div class="row mobile-row">
            <div class="col">
              <div class="sidenav-view-selector">
                <div class="accordion accordion-flush" id="accordionFlush9">
                  <div class="accordion-item">
                    <h2 class="accordion-header" id="flush-headingNine">
                      <button class="accordion-button collapsed" id="instructor" type="button" data-bs-toggle="collapse" data-bs-target="#flush-collapseNine" aria-expanded="false" aria-controls="flush-collapseNine">
                        <i id="eye" aria-hidden="true" class="icon" data-feather="eye"></i> Instructor View
                      </button>
                    </h2>
                    <div id="flush-collapseNine" class="accordion-collapse collapse" aria-labelledby="flush-headingNine" data-bs-parent="#accordionFlush2">
                      <div class="accordion-body">
                        <a href="../aio.html">Learner View</a>
                      </div>
                    </div>
                  </div>
<!--/div.accordion-item-->
                </div>
<!--/div.accordion-flush-->
              </div>
<!--div.sidenav-view-selector -->
            </div>
<!--/div.col -->

            <hr>
</div>
<!--/div.mobile-row -->

          <div class="accordion accordion-flush" id="accordionFlush11">
            <div class="accordion-item">

              <button id="chapters" class="accordion-button show" type="button" data-bs-toggle="collapse" data-bs-target="#flush-collapseEleven" aria-expanded="false" aria-controls="flush-collapseEleven">
                <h2 class="accordion-header chapters" id="flush-headingEleven">
                  EPISODES
                </h2>
              </button>
              <div id="flush-collapseEleven" class="accordion-collapse show collapse" aria-labelledby="flush-headingEleven" data-bs-parent="#accordionFlush11">

                <div class="accordion-body">
                  <div class="accordion accordion-flush" id="accordionFlush1">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading1">
        <a href="index.html">Summary and Schedule</a>
    </div>
<!--/div.accordion-header-->

  </div>
<!--/div.accordion-item-->
</div>
<!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush2">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading2">
        <a href="01-introduction.html">1. What is Wikidata?</a>
    </div>
<!--/div.accordion-header-->

  </div>
<!--/div.accordion-item-->
</div>
<!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush3">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading3">
        <a href="02-Wikidata_underlying_concepts.html">2. Underlying concepts of Wikidata</a>
    </div>
<!--/div.accordion-header-->

  </div>
<!--/div.accordion-item-->
</div>
<!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush4">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading4">
        <a href="03-intro_to_editing.html">3. Introduction to editing</a>
    </div>
<!--/div.accordion-header-->

  </div>
<!--/div.accordion-item-->
</div>
<!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush5">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading5">
        <a href="04-advanced_editing.html">4. Advanced editing</a>
    </div>
<!--/div.accordion-header-->

  </div>
<!--/div.accordion-item-->
</div>
<!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush6">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading6">
        <a href="05-intro_to_querying.html">5. Introduction to querying</a>
    </div>
<!--/div.accordion-header-->

  </div>
<!--/div.accordion-item-->
</div>
<!--/div.accordion-flush-->

<div class="accordion accordion-flush" id="accordionFlush7">
  <div class="accordion-item">
    <div class="accordion-header" id="flush-heading7">
        <a href="06-bulk_actions.html">6. Advanced bulk updating, bots</a>
    </div>
<!--/div.accordion-header-->

  </div>
<!--/div.accordion-item-->
</div>
<!--/div.accordion-flush-->

                </div>
              </div>
            </div>

            <hr class="half-width">
<div class="accordion accordion-flush lesson-resources" id="accordionFlush12">
              <div class="accordion-item">
                <h2 class="accordion-header" id="flush-headingTwelve">
                  <button class="accordion-button collapsed" id="lesson-resources" type="button" data-bs-toggle="collapse" data-bs-target="#flush-collapseTwelve" aria-expanded="false" aria-controls="flush-collapseTwelve">
                    RESOURCES
                  </button>
                </h2>
                <div id="flush-collapseTwelve" class="accordion-collapse collapse" aria-labelledby="flush-headingTwelve" data-bs-parent="#accordionFlush12">
                  <div class="accordion-body">
                    <ul>
<li>
                        <a href="../instructor/key-points.html">Key Points</a>
                      </li>
                      <li>
                        <a href="../instructor/instructor-notes.html">Instructor Notes</a>
                      </li>
                      <li>
                        <a href="../instructor/images.html">Extract All Images</a>
                      </li>
                      <li><a href="design.html">Lesson Design</a></li>
<hr>
<li><a class="dropdown-item" href="discuss.html">Discussion</a></li>
<li><a class="dropdown-item" href="reference.html">FIXME</a></li>
                    </ul>
</div>
                </div>
              </div>
            </div>
            <hr class="half-width lesson-resources">
<a href="../instructor/aio.html">See all in one page</a>


            <hr class="d-none d-sm-block d-md-none">
<div class="d-grid gap-1">

            </div>
          </div>
<!-- /div.accordion -->
        </div>
<!-- /div.sidebar-inner -->
      </nav>
</div>
<!-- /div.sidebar -->
  </div>
<!-- /div.sidebar-col -->
<!-- END:   inst/pkgdown/templates/navbar.html-->

        <!-- START: inst/pkgdown/templates/content-extra.html -->
  <div class="col-xl-8 col-lg-12 primary-content">
    <main id="main-content" class="main-content"><div class="container lesson-content">
        
        
<section id="aio-01-introduction"><p>Content from <a href="01-introduction.html">What is Wikidata?</a></p>
<hr>
<p>Last updated on 2024-10-21 |

        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/episodes/01-introduction.md" class="external-link">Edit this page <i aria-hidden="true" data-feather="edit"></i></a></p>
<p>Estimated time: <i aria-hidden="true" data-feather="clock"></i> 30 minutes</p>
<div class="text-end">
          <button role="button" aria-pressed="false" tabindex="0" id="expand-code" class="pull-right" data-expand="Expand All Solutions " data-collapse="Collapse All Solutions "> Expand All Solutions <i aria-hidden="true" data-feather="plus"></i></button>
        </div>
<div class="overview card">
<h2 class="card-header">Overview</h2>
<div class="row g-0">
<div class="col-md-4">
<div class="card-body">
<div class="inner">
<h3 class="card-title">Questions</h3>
<ul>
<li>What are Items and Statements?</li>
<li>How does the Wikidata interface look like?</li>
<li>How is Wikidata linked to other Wiki projects?</li>
</ul>
</div>
</div>
</div>
<div class="col-md-8">
<div class="card-body">
<div class="inner bordered">
<h3 class="card-title">Objectives</h3>
<ul>
<li>Feel comfortable describing Wikidata to colleagues.</li>
<li>Learn about Wikimedia projects (e.g. Wikipedia, WikiCommons) and
Wikidata is related to them.</li>
<li>Know why linked open data is important in my work as a cataloging or
teaching librarian.</li>
<li>Know able identify components of a Wikidata item page, how Wikidata
is organized and how to navigate in it.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<section><h2 class="section-heading" id="what-is-wikidata">What is Wikidata?<a class="anchor" aria-label="anchor" href="#what-is-wikidata"></a>
</h2>
<hr class="half-width">
<p>Wikidata’s <a href="https://www.wikidata.org/wiki/Wikidata:Main_Page" class="external-link">description</a>
explains that “Wikidata is a free and open knowledge base that can be
read and edited by both humans and machines.” Wikidata functions as the
central database for a variety of Wiki projects, including Wikipedia,
Wiktionary, and Wikisource, among others.</p>
<p>Most users will be familiar with Wikpedia, which <a href="https://en.wikipedia.org/wiki/Wikipedia:Introduction" class="external-link">describes
itself</a> as “a free encyclopedia, written collaboratively by the
people who use it. It is a special type of website designed to make
collaboration easy, called a wiki. Many people are constantly improving
Wikipedia, making thousands of changes per hour. All of these changes
are recorded in article histories and recent changes.”</p>
<p>Wikidata contains various data types (e.g. text, images, quantities,
coordinates, geographic shapes, dates). The data can be queried via a
query interface called SPARQL, which we will cover later in this lesson.
Data is published under the Creative Commons Public Domain 1.0 license.
It can be modified, copied, and distributed without permission.</p>
<p>Wikidata also contains authority files, bibliographic data, and other
content normally managed in library databases.</p>
<p>Importantly, Wikidata can be <a href="https://www.wikidata.org/wiki/Wikidata:Data_access#How_can_I_get_data_out_of_Wikidata?" class="external-link">interlinked</a>
to other open data sets on the linked data web.</p>
</section><section><h2 class="section-heading" id="motivation-and-why-should-i-use-wikidata">Motivation and “Why should I use Wikidata”<a class="anchor" aria-label="anchor" href="#motivation-and-why-should-i-use-wikidata"></a>
</h2>
<hr class="half-width">
<ol style="list-style-type: decimal">
<li><p>Knowledge Integration and Access: Wikidata offers an open and
structured way to interlink various identifiers (like ORCID, GND, or
VIAF). This is essential for librarians who manage resources and need to
ensure that different systems and databases can communicate with each
other seamlessly.</p></li>
<li><p>Authority Control: Librarians often work with authority files
like GND or VIAF to ensure consistent naming conventions. Wikidata helps
to map and retrieve these identifiers, making cataloging more
efficient.</p></li>
<li><p>Real-World Use Cases:</p></li>
</ol>
<ul>
<li>
<strong>Scholia</strong>: A tool built on top of Wikidata that
visualizes scholarly profiles and research outputs, showing the impact
of Wikidata in academic and research contexts. Librarians can showcase
Scholia as a tangible example of how data in Wikidata is used for
research and scholarship.</li>
<li>
<strong>Crosswalks between systems</strong>: Wikidata’s ability to
link various identifiers (e.g., connecting ORCID to GND or VIAF) is
beneficial for cross-referencing and data cleaning in library management
systems.</li>
</ul>
<ol start="4" style="list-style-type: decimal">
<li>Global and Collaborative Nature: Wikidata is a collaborative
platform where librarians can contribute and maintain data, ensuring
that their records stay relevant and up to date within a global
information network.</li>
</ol></section><section><h2 class="section-heading" id="intro-interface">1.1 Intro interface<a class="anchor" aria-label="anchor" href="#intro-interface"></a>
</h2>
<hr class="half-width">
<ul>
<li><p>Let’s try this out in the next section of this lesson and see if
we as humans can simply read the data on Wikidata:</p></li>
<li>
<p>Explore a Wikidata Item page:</p>
<ul>
<li>Start by going to the <a href="https://www.wikidata.org/wiki/Wikidata:Main_Page" class="external-link">Wikidata Main
Page</a> by typing “www.wikidata.org” into your browser. This is what
you should see:</li>
</ul>
<p><img src="../fig/Wikidata_Main_Page.png" alt="Wikidata_Main_Page" class="figure"><br><em>Screenshot of <a href="https://www.wikidata.org/wiki/Wikidata:Main_Page" class="external-link">Wikidata Main
Page</a></em></p>
<ul>
<li><p>Now go to the search bar in the top right corner and enter
“british library”. This will give you a list with search results. Click
the entry that says: “British Library (Q23308) national library of the
United Kingdom”. Now you should see the british library’s item page: <a href="https://www.wikidata.org/wiki/Q23308" class="external-link">https://www.wikidata.org/wiki/Q23308</a></p></li>
<li>
<p>Let us explore the item British Library (Q23308). The top part of
the item page serves for identifying the item. It has:</p>
<ul>
<li>unique identifier (Q + a number)</li>
<li>label</li>
<li>description</li>
<li>aliases</li>
</ul>
</li>
<li>
<p>The bottom part is the “statement” section, that adds statements
to the item. A statement has:</p>
<ul>
<li>property (P + a number)</li>
<li>value</li>
<li>qualifier (optional)</li>
<li>references (optional)</li>
<li>is a so called triple which will be explained later</li>
<li>As you can see a property can have multiple values for one property;
for example “member of”; can be further specified by qualifiers (not
showen on item British Library).</li>
</ul>
</li>
</ul>
</li>
<li><p>All these new definitions like statements, qualifiers and so on
can be confusing. If you are not sure you can check this overview
graphic <a href="https://upload.wikimedia.org/wikipedia/commons/a/ae/Datamodel_in_Wikidata.svg" class="external-link">https://upload.wikimedia.org/wikipedia/commons/a/ae/Datamodel_in_Wikidata.svg</a>:</p></li>
</ul>
<figure><img src="https://upload.wikimedia.org/wikipedia/commons/a/ae/Datamodel_in_Wikidata.svg" alt="Datamodel in Wikidata" class="figure mx-auto d-block"></figure><ul>
<li>
<p>Usually pages can be edited by anyone; click the pen on the
upper-right; Q23308 - British Library is semi-protected; don’t worry if
you made a mistake, you can always go back in history</p>
<ul>
<li>“View history” - more later</li>
<li>“Log in” and other things for registered users</li>
</ul>
</li>
<li><p>All structured data is under the creative Creative Commons CC0
License: “The person who associated a work with this deed has dedicated
the work to the public domain by waiving all of his or her rights to the
work worldwide under copyright law, including all related and
neighboring rights, to the extent allowed by law. You can copy, modify,
distribute and perform the work, even for commercial purposes, all
without asking permission.” from <a href="https://creativecommons.org/publicdomain/zero/1.0/" class="external-link">https://creativecommons.org/publicdomain/zero/1.0/</a></p></li>
<li>
<p>Further Link describing Wikidata in one page (visual)</p>
<ul>
<li><a href="https://commons.wikimedia.org/wiki/File:Wikidata-in-brief-1.0.pdf" class="external-link">https://commons.wikimedia.org/wiki/File:Wikidata-in-brief-1.0.pdf</a></li>
</ul>
</li>
</ul></section><section><h2 class="section-heading" id="play-games-to-open">1.2 Play games to open<a class="anchor" aria-label="anchor" href="#play-games-to-open"></a>
</h2>
<hr class="half-width">
<ul>
<li>Visit the Wikipedia page of the city you were born in two languages
of you choice (you can choose different language version in the left
side of a Wikipedia page) and look the size of the population. Are the
numbers the same in the different language? Visit the item in
Wikidata.</li>
</ul></section><section><h2 class="section-heading" id="wikidata-item-eastereggs">1.3 Wikidata Item Eastereggs<a class="anchor" aria-label="anchor" href="#wikidata-item-eastereggs"></a>
</h2>
<hr class="half-width">
<ul>
<li><a href="https://www.wikidata.org/wiki/Q1" class="external-link">Q1 - Universe</a></li>
<li><a href="https://www.wikidata.org/wiki/Q2" class="external-link">Q2 - Earth</a></li>
<li><a href="https://www.wikidata.org/wiki/Q3" class="external-link">Q3 - Life</a></li>
<li><a href="https://www.wikidata.org/wiki/Q4" class="external-link">Q4 - Death</a></li>
<li><a href="https://www.wikidata.org/wiki/Q5" class="external-link">Q5 - Human</a></li>
<li><a href="https://www.wikidata.org/wiki/Q13" class="external-link">Q13 - Fear of the number
13</a></li>
<li><a href="https://www.wikidata.org/wiki/Q24" class="external-link">Q24 - Jack
Bauer</a></li>
<li><a href="https://www.wikidata.org/wiki/Q42" class="external-link">Q42 - Douglas Adams (The
Hitchhiker’s Guide to the Galaxy)</a></li>
<li><a href="https://www.wikidata.org/wiki/Q404" class="external-link">Q404 - HTTP
404</a></li>
<li><a href="https://www.wikidata.org/wiki/Q666" class="external-link">Q666 - Number of the
beast</a></li>
<li><a href="https://www.wikidata.org/wiki/Q12345" class="external-link">Q12345 - Count von
Count, Character on Sesame Street</a></li>
</ul></section><section><h2 class="section-heading" id="linking-wikidata-to-other-wiki-resources">1.4 Linking Wikidata to other Wiki resources<a class="anchor" aria-label="anchor" href="#linking-wikidata-to-other-wiki-resources"></a>
</h2>
<hr class="half-width">
<ul>
<li>Link from Wikipedia to Wikidata
<ul>
<li>e.g. <a href="https://en.wikipedia.org/wiki/On_the_Origin_of_Species" class="external-link">https://en.wikipedia.org/wiki/On_the_Origin_of_Species</a>
<ul>
<li>=&gt; Follow the link “Wikidata item” on the left side under
“tools”</li>
<li>=&gt; <a href="https://www.wikidata.org/wiki/Q20124" class="external-link">https://www.wikidata.org/wiki/Q20124</a>
</li>
<li>=&gt; the Wikipedia article is linked on the Wikidata’s item page.
You can find it on the right side.</li>
<li>=&gt; link to WikiCommons and WikiSource</li>
</ul>
</li>
</ul>
</li>
</ul>
<div id="keypoints1" class="callout keypoints">
<div class="callout-square">
<i class="callout-icon" data-feather="key"></i>
</div>
<span class="callout-header">Key Points</span>
<div class="callout-inner">
<div class="callout-content">
<ul>
<li>Item</li>
<li>Statement</li>
</ul>
</div>
</div>
</div>
</section></section><section id="aio-02-Wikidata_underlying_concepts"><p>Content from <a href="02-Wikidata_underlying_concepts.html">Underlying concepts of Wikidata</a></p>
<hr>
<p>Last updated on 2023-04-24 |

        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/episodes/02-Wikidata_underlying_concepts.md" class="external-link">Edit this page <i aria-hidden="true" data-feather="edit"></i></a></p>
<p>Estimated time: <i aria-hidden="true" data-feather="clock"></i> 0 minutes</p>
<div class="text-end">
          <button role="button" aria-pressed="false" tabindex="0" id="expand-code" class="pull-right" data-expand="Expand All Solutions " data-collapse="Collapse All Solutions "> Expand All Solutions <i aria-hidden="true" data-feather="plus"></i></button>
        </div>
<div class="overview card">
<h2 class="card-header">Overview</h2>
<div class="row g-0">
<div class="col-md-4">
<div class="card-body">
<div class="inner">
<h3 class="card-title">Questions</h3>
<ul>
<li>What is a RDF triple?</li>
<li>What are the underlying components of RDF?</li>
</ul>
</div>
</div>
</div>
<div class="col-md-8">
<div class="card-body">
<div class="inner bordered">
<h3 class="card-title">Objectives</h3>
<ul>
<li>Know what a triple is, and relate structure of a Wikidata statement
to traditional metadata field structure</li>
<li>Know how linked data can create more context for patrons/users in
library catalogs</li>
<li>Know how linked data can improve recall in library catalogs? (TODO:
Check if we want to address this here).</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<section><h2 class="section-heading" id="concepts-foundations-ways-of-storing-data-">2.1 Concepts foundations: ways of storing data.<a class="anchor" aria-label="anchor" href="#concepts-foundations-ways-of-storing-data-"></a>
</h2>
<hr class="half-width">
<p>There are many types of databases, the most common types are:</p>
<div class="section level3">
<h3 id="relational-databases">2.1.1 Relational databases:<a class="anchor" aria-label="anchor" href="#relational-databases"></a>
</h3>
<p>A relational database is a set of formally described related tables
from which data can be accessed or reassembled. This model organizes
data into one or more tables (or “relations”) of columns and rows, with
a unique key identifying each row. each table/relation represents one
“entity type” and these entities are connected via constrained
relationships. This model is fully structured and mostly uses SQL
(Structured Query Language) to retrive and manuplate data.<br>
Examples:</p>
<figure><img src="../fig/Relational_database_terms.svg.png" alt="relational database" class="figure mx-auto d-block"></figure>
</div>
<div class="section level3">
<h3 id="graph-semantic-databases">2.1.2 Graph / Semantic databases<a class="anchor" aria-label="anchor" href="#graph-semantic-databases"></a>
</h3>
<p>Semantic web is an extension of the World Wide Web standards, which
promote common data formats and exchange protocols on the Web, most
fundamentally the Resource Description Framework (RDF) is used to store
data. Most RDF fundamentally uses SPARQL (Simple Protocol and Rdf Query
Language) to read stored data while relational databases uses SQL
(Structured Query Language) to do so. In SQL relational database terms,
RDF data can also be considered or viewed as a table with only three
columns – the subject column, the predicate column, and the object
column.</p>
<figure><img src="../fig/Data_Structure_Diagram.jpg" alt="data structure diagram" class="figure mx-auto d-block"></figure>
</div>
</section><section><h2 class="section-heading" id="concepts-foundations-rdf-and-rdf-triples">2.2 Concepts foundations (RDF and RDF triples)<a class="anchor" aria-label="anchor" href="#concepts-foundations-rdf-and-rdf-triples"></a>
</h2>
<hr class="half-width">
<ul>
<li><p>The RDF is a conceptual data model, It is based on the idea of
making statements about resources in expressions of the form
(subject–predicate–object), known as triples.</p></li>
<li><p>The subject denotes the resource, and the predicate denotes
traits or aspects of the resource, and expresses a relationship between
the subject and the object, for example: John-is-a person, John-born
in-1980, John-works as-Engineer</p></li>
<li><p>RDF data are stored on containers known as triplestores.</p></li>
<li><p><a href="https://en.wikipedia.org/wiki/Semantic_triple" class="external-link">https://en.wikipedia.org/wiki/Semantic_triple</a></p></li>
</ul>
<figure><img src="../fig/RDF_subject_predicate_object.jpg" alt="RDF Tripe" class="figure mx-auto d-block"></figure></section><section><h2 class="section-heading" id="underlying-components">2.3 Underlying components<a class="anchor" aria-label="anchor" href="#underlying-components"></a>
</h2>
<hr class="half-width">
<ul>
<li>Items<br>
Items represents subjects such Douglas Adams and have identifiers that
starts with letter “Q” like: Q42 for Douglas Adams.<br>
Each item must have a name in one or more langauges, optionally have
alternative names and descrition.</li>
<li>Properties<br>
Properties represents attributes of the subject such occupation and have
identifiers that starts with letter “P” like: P106 for Occupation.</li>
<li>Claims<br>
Claims are the triples, which combine the formation of Item and Property
and a value such: Douglas Adams (Q42) - occupation (P106) -
comedian.<br>
Note: value can be already stored in wikidata, therefore the bot assigns
the Q number of the value instead.</li>
<li>Statement<br>
A Claim is a part of a statement, a statement also includes: References,
Ranks, and Qualifiers.</li>
<li>References<br>
Used to store the source of the claim, using properties, such stated in,
qoute, and etc.</li>
<li>Ranks<br>
A useful component to mark outdated claims.</li>
<li>Qualifiers<br>
Qualifiers are besicly properties but on claims rather than items.</li>
</ul>
<div id="is-data-stored-in-the-rdf-triple-format-part-of-your-work-as-a-librarian" class="callout challenge">
<div class="callout-square">
<i class="callout-icon" data-feather="zap"></i>
</div>
<span class="callout-header">Challenge</span>
<div id="is-data-stored-in-the-rdf-triple-format-part-of-your-work-as-a-librarian" class="callout-inner">
<h3 class="callout-title">Is data stored in the RDF triple format part
of your work as a librarian?</h3>
<div class="callout-content">
<p>Take some time to think about if data stored in the RDF triple format
is part of your work as a librarian. Can you give an example in the
format of an RDF triplet?</p>
</div>
</div>
</div>
<div id="accordionSolution1" class="accordion challenge-accordion accordion-flush">
<div class="accordion-item">
<button class="accordion-button solution-button collapsed" type="button" data-bs-toggle="collapse" data-bs-target="#collapseSolution1" aria-expanded="false" aria-controls="collapseSolution1">
  <h4 class="accordion-header" id="headingSolution1"> Show me the solution </h4>
</button>
<div id="collapseSolution1" class="accordion-collapse collapse" aria-labelledby="headingSolution1" data-bs-parent="#accordionSolution1">
<div class="accordion-body">
<p><em>TO DO</em>: PLEASE ADD A REAL LIFE EXAMPLE</p>
</div>
</div>
</div>
</div>
<div id="point-out-one-rdf-triple-on-the-wikidata-item-page-of-former-astronaut-mae-jemison." class="callout challenge">
<div class="callout-square">
<i class="callout-icon" data-feather="zap"></i>
</div>
<span class="callout-header">Challenge</span>
<div id="point-out-one-rdf-triple-on-the-wikidata-item-page-of-former-astronaut-mae-jemison." class="callout-inner">
<h3 class="callout-title">Point out one RDF triple on the Wikidata item
page of former astronaut Mae Jemison.</h3>
<div class="callout-content">
<p>Got to the Wikidata page of Mae Jemison and point out one RDF triple.
An RDF triplet consists of a subject, a predicate and an object. Can you
assign the three corresponding Wikidata terms?</p>
</div>
</div>
</div>
<div id="accordionSolution2" class="accordion challenge-accordion accordion-flush">
<div class="accordion-item">
<button class="accordion-button solution-button collapsed" type="button" data-bs-toggle="collapse" data-bs-target="#collapseSolution2" aria-expanded="false" aria-controls="collapseSolution2">
  <h4 class="accordion-header" id="headingSolution2"> Show me the solution </h4>
</button>
<div id="collapseSolution2" class="accordion-collapse collapse" aria-labelledby="headingSolution2" data-bs-parent="#accordionSolution2">
<div class="accordion-body">
<p>Got to Wikidata and either search for “Mae Jemison” or enter the ID
<em>Q34091</em>. In the picture below the statement “Mae C. Jemison -
part of - NASA Astronaut Group 12” is an RDF triple. <img src="../fig/Mae_Jemison_Wikidata.png" alt="Wikidata_Main_Page" class="figure"><br><em>Screenshot of <a href="https://www.wikidata.org/wiki/Q34091" class="external-link">Wikidata Main
Page</a></em></p>
</div>
</div>
</div>
</div>
</section><section><h2 class="section-heading" id="scholia---a-webserive-with-wikidata-as-underlying-database">2.4 Scholia - a webserive with Wikidata as underlying database<a class="anchor" aria-label="anchor" href="#scholia---a-webserive-with-wikidata-as-underlying-database"></a>
</h2>
<hr class="half-width">
<ul>
<li>Introduction with <a href="https://www.lod-cloud.net/" class="external-link">The Linked
Open Data Cloud</a>
</li>
<li>the structure enables queries</li>
<li>reference to DBPedia</li>
<li>you can build your own web services with Wikidata as database &gt;
<a href="https://scholia.toolforge.org/" class="external-link">Scholia</a>
<ul>
<li>e.g. search for Alex Bateman</li>
</ul>
</li>
</ul></section><section><h2 class="section-heading" id="wikidata-one-pager">2.5 Wikidata one pager<a class="anchor" aria-label="anchor" href="#wikidata-one-pager"></a>
</h2>
<hr class="half-width">
<ul>
<li><a href="https://commons.wikimedia.org/wiki/File:Wikidata-in-brief-1.0.pdf" class="external-link">https://commons.wikimedia.org/wiki/File:Wikidata-in-brief-1.0.pdf</a></li>
</ul></section><section><h2 class="section-heading" id="how-wikidata-compares-with-other-data-sets">2.6 How Wikidata compares with other data sets<a class="anchor" aria-label="anchor" href="#how-wikidata-compares-with-other-data-sets"></a>
</h2>
<hr class="half-width">
<ul>
<li><a href="https://meta.wikimedia.org/wiki/Wikidata/Notes/DBpedia_and_Wikidata" class="external-link">https://meta.wikimedia.org/wiki/Wikidata/Notes/DBpedia_and_Wikidata</a></li>
<li><a href="https://lod-cloud.net/" class="external-link">https://lod-cloud.net/</a></li>
</ul>
<p>FIXME</p>
<div id="keypoints1" class="callout keypoints">
<div class="callout-square">
<i class="callout-icon" data-feather="key"></i>
</div>
<span class="callout-header">Key Points</span>
<div class="callout-inner">
<div class="callout-content">
<ul>
<li>First key point. (FIXME)</li>
</ul>
</div>
</div>
</div>
</section></section><section id="aio-03-intro_to_editing"><p>Content from <a href="03-intro_to_editing.html">Introduction to editing</a></p>
<hr>
<p>Last updated on 2024-01-11 |

        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/episodes/03-intro_to_editing.md" class="external-link">Edit this page <i aria-hidden="true" data-feather="edit"></i></a></p>
<p>Estimated time: <i aria-hidden="true" data-feather="clock"></i> 0 minutes</p>
<div class="text-end">
          <button role="button" aria-pressed="false" tabindex="0" id="expand-code" class="pull-right" data-expand="Expand All Solutions " data-collapse="Collapse All Solutions "> Expand All Solutions <i aria-hidden="true" data-feather="plus"></i></button>
        </div>
<div class="overview card">
<h2 class="card-header">Overview</h2>
<div class="row g-0">
<div class="col-md-4">
<div class="card-body">
<div class="inner">
<h3 class="card-title">Questions</h3>
<ul>
<li>How to create and edit a Wikidata item?</li>
</ul>
</div>
</div>
</div>
<div class="col-md-8">
<div class="card-body">
<div class="inner bordered">
<h3 class="card-title">Objectives</h3>
<ul>
<li>Be able to create and edit a Wikidata entry.</li>
<li>Know properties and relations, and where to find lists of approved
properties and relations.</li>
<li>Be able to add new statements that link to other items.</li>
<li>Be aware of property constraints.</li>
<li>Know community norms around Wikidata and why they are
important.</li>
<li>Be able to add references appropriately.</li>
<li>Know what identifiers are and how to add them to a statement.</li>
<li>Know different stable identifiers (e.g. ORCID for authors, DOI for
works) and why makes sense to use them as properties.</li>
<li>Know the correct use of properties.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<section><h2 class="section-heading" id="introduction">3.1 Introduction<a class="anchor" aria-label="anchor" href="#introduction"></a>
</h2>
<hr class="half-width">
<p>Here we will work in the test instance of Wikidata so you will not
break anything. Also keep in mind that the editing history is kept in
Wikidata so error can also be easily fixed there. The test instance is
cleaned regularly. You can quickly figure out if you are on the Wikidata
instance (colored logo) or the test version (black-and-white only).</p>
</section><section><h2 class="section-heading" id="create-new-items">3.2 Create new items<a class="anchor" aria-label="anchor" href="#create-new-items"></a>
</h2>
<hr class="half-width">
<p>In the following we will create new items. In order to avoid to fill
Wikidata with test entries, we will use the test instance (<a href="https://test.wikidata.org/" class="external-link">https://test.wikidata.org/</a>) and
not the official, production version (<a href="https://wikidata.org/" class="external-link">https://wikidata.org/</a>).</p>
<p>Go to the test instance at <a href="https://test.wikidata.org/" class="external-link">https://test.wikidata.org/</a></p>
<p>Click “<a href="https://test.wikidata.org/wiki/Special:NewItem" class="external-link">Create a new
Item</a>” link on the left site. You will see a form that looks like
this:</p>
<figure><img src="../fig/l03-Screenshot_test_instance_front_page.png" alt="Front Page of the test instance" class="figure mx-auto d-block"></figure><ul>
<li>Please fill the form. You can now add an entry about anything you
want like a book, a research article or and author. We will generate an
entry of <a href="https://en.wikipedia.org/wiki/Mae_Jemison" class="external-link">Mae
Jemison</a> an American engineer, physician and NASA astronaut. You can
also add yourself (if you feel famous enough). We choose “en” int the
<em>Language</em> drop-down menue, write “Mae Jemison” in the
<em>Label</em> field, “an American engineer, physician and NASA
astronaut.” in the <em>Description</em> field and “Mae Carol Jemison” in
the <em>Aliases</em> field.</li>
</ul>
<figure><img src="../fig/l03-Screenshot_test_instance_empty_create_page.png" alt="Empty create form of the test instance" class="figure mx-auto d-block"></figure><figure><img src="../fig/l03-Mae_Jemison_01_Enter_in_form.png" alt="Empty create form of the test instance" class="figure mx-auto d-block"></figure><ul>
<li>Once we are done we click click “Create”. You should see you newly
created article. The URL, the adress shown in your web browser, should
contain “Q” and some number that is unique for this entry at the
end.</li>
</ul>
<figure><img src="../fig/l03-Mae_Jemison_02_Newly_created_page.png" alt="Freshly created Item of Mae Jemison" class="figure mx-auto d-block"></figure><p>You can compare the entry that you have generated on the test
instance with the current version of the item in Wikidata (<a href="https://www.wikidata.org/wiki/Q34091" class="external-link">Q34091</a>).</p>
<figure><img src="../fig/l03-Mae_Jemison_03_Official_Wikidata_entry_full.png" alt="Wikidata Jemison" class="figure mx-auto d-block"></figure></section><section><h2 class="section-heading" id="add-statements---birth-reference">3.3 Add Statements - birth reference<a class="anchor" aria-label="anchor" href="#add-statements---birth-reference"></a>
</h2>
<hr class="half-width">
<p>Why Wikidata uses references: Like in Wikipedia it is important that
content can be verified by others to make sure it is correct and comes
from a reliable source of information, such as a book, scientific
publication, or newspaper article. A Reference (or source) is used to
point to specific sources that back up a claim in Wikidata. A reference
can be a link to a URL or an item; for example, a book. Wikidata does
not aim to answer the question of whether a statement is correct, but
only whether the statement appears in a reference.</p>
<p>Task:</p>
<ul>
<li>
<p>Support a statement by reference</p>
<ul>
<li>Add the birth date (October 17, 1956) of Mae Jemison as a statement
using property P569 “date of birth” to the “Mae X Jemison” item you
created above.</li>
<li>Afterwards add a reference to the satement with the following url as
the source: <a href="https://www.biography.com/astronaut/mae-c-jemison" class="external-link">https://www.biography.com/astronaut/mae-c-jemison</a>
</li>
</ul>
</li>
</ul></section><section><h2 class="section-heading" id="add-statements---add-id-to-mae-jemison">3.4 Add Statements - Add ID to Mae Jemison<a class="anchor" aria-label="anchor" href="#add-statements---add-id-to-mae-jemison"></a>
</h2>
<hr class="half-width">
<p>Task: Support a person by it’s IDs. Give the participtants the
identifiers and source page for an ID and let them add it on the Mae
Jemison item on the test instance of Wikidata:</p>
<ul>
<li>VIAF ID
<ul>
<li>identifier: 33699121</li>
<li>source page: <a href="https://viaf.org/viaf/33699121/" class="external-link">https://viaf.org/viaf/33699121/</a>
</li>
</ul>
</li>
<li>Library of Congress authority ID
<ul>
<li>identfier: n95004729</li>
<li>source page: <a href="https://id.loc.gov/authorities/names/n95004729.html" class="external-link">http://id.loc.gov/authorities/names/n95004729.html</a>
</li>
</ul>
</li>
<li>IMDb ID
<ul>
<li>identifier: nm0420648</li>
<li>source page: <a href="https://www.imdb.com/name/nm0420648/" class="external-link">https://www.imdb.com/name/nm0420648/</a>
Site note:</li>
</ul>
</li>
<li>ORCID is an often used ID, in this case Mae Jemison doesn’t have
one, but it’s good to mention ORCID anyway.</li>
</ul></section><section><h2 class="section-heading" id="norms-and-good-practices">3.5 Norms and good practices<a class="anchor" aria-label="anchor" href="#norms-and-good-practices"></a>
</h2>
<hr class="half-width">
<ul>
<li>Customization of languages for user interface</li>
<li>Wikidata “item” vs. “article” vs. “entry”</li>
<li>Policies for
<ul>
<li><a href="https://www.wikidata.org/wiki/Special:MyLanguage/Help:Label" class="external-link">Labels</a></li>
<li><a href="https://www.wikidata.org/wiki/Special:MyLanguage/Help:Description" class="external-link">Descriptions</a></li>
</ul>
</li>
<li>Books
<ul>
<li><a href="https://www.wikidata.org/wiki/Wikidata:WikiProject_Books" class="external-link">Data
model</a></li>
<li><a href="https://inventaire.io/welcome" class="external-link">Inventaire</a></li>
</ul>
</li>
</ul>
<div id="keypoints1" class="callout keypoints">
<div class="callout-square">
<i class="callout-icon" data-feather="key"></i>
</div>
<span class="callout-header">Key Points</span>
<div class="callout-inner">
<div class="callout-content">
<ul>
<li>create new items</li>
<li>add new statements</li>
</ul>
</div>
</div>
</div>
</section></section><section id="aio-04-advanced_editing"><p>Content from <a href="04-advanced_editing.html">Advanced editing</a></p>
<hr>
<p>Last updated on 2025-09-29 |

        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/episodes/04-advanced_editing.md" class="external-link">Edit this page <i aria-hidden="true" data-feather="edit"></i></a></p>
<p>Estimated time: <i aria-hidden="true" data-feather="clock"></i> 0 minutes</p>
<div class="text-end">
          <button role="button" aria-pressed="false" tabindex="0" id="expand-code" class="pull-right" data-expand="Expand All Solutions " data-collapse="Collapse All Solutions "> Expand All Solutions <i aria-hidden="true" data-feather="plus"></i></button>
        </div>
<div class="overview card">
<h2 class="card-header">Overview</h2>
<div class="row g-0">
<div class="col-md-4">
<div class="card-body">
<div class="inner">
<h3 class="card-title">Questions</h3>
<ul>
<li>How to automatically add statements with sourcemd and
quickstatements?</li>
</ul>
</div>
</div>
</div>
<div class="col-md-8">
<div class="card-body">
<div class="inner bordered">
<h3 class="card-title">Objectives</h3>
<ul>
<li>Be familiar with some tools for editing, e.g. TABernacle, Wikidata
Games, QuickStatements, Source MetaData or Author Disambiguator/Author
resolver.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<section><h2 class="section-heading" id="disclaimer">4.1 Disclaimer<a class="anchor" aria-label="anchor" href="#disclaimer"></a>
</h2>
<hr class="half-width">
<p>The tools are under heavy development and due to that they might
change or don’t work as expected. If that happens just move on to the
next episode.</p>
</section><section><h2 class="section-heading" id="introduction">4.2 Introduction<a class="anchor" aria-label="anchor" href="#introduction"></a>
</h2>
<hr class="half-width">
<p>So now we will work in the productive version. We will use DOI to
automatically put an article into Wikidata via sourcemd. If you are
familiar in Life Science you can use our example with PubMed for finding
DOIs of new article, optional you can choose an journal related to your
scientific field. Sourcemd gets it metadata from <a href="https://de.wikipedia.org/wiki/Crossref" class="external-link">Crossref</a>, also look to
<a href="https://www.wikidata.org/wiki/Wikidata:SourceMD/instructions" class="external-link">sourcemd:instructions</a></p>
<p>Potential open access journal:</p>
<ul>
<li><a href="https://plos.org/" class="external-link">PLOS One</a></li>
<li><a href="https://www.beilstein-journals.org/bjoc/articles/16/138" class="external-link">Beilstein
Journal of Organic Chemistry (BJOC)</a></li>
</ul></section><section><h2 class="section-heading" id="adding-statements-via-sourcemd-and-quickstatements">4.3 Adding statements via sourcemd and quickstatements<a class="anchor" aria-label="anchor" href="#adding-statements-via-sourcemd-and-quickstatements"></a>
</h2>
<hr class="half-width">
<p>Go to <a href="https://pubmed.ncbi.nlm.nih.gov/" class="external-link">pubmed</a>, scroll
down to “latest literature” and select an article: <img src="../fig/episode_04_screenshot_01_latest_articles.png" alt="latest_articles" class="figure"></p>
<p>Save the DOI, PMID or PMCID of the article:</p>
<figure><img src="../fig/episode_04_screenshot_02_choose_doi.png" alt="choose_doi" class="figure mx-auto d-block"></figure><p>Go to <a href="https://sourcemd.toolforge.org/index_old.php" class="external-link">sourcemd</a> and
paste the DOI or PMID into the search field:</p>
<figure><img src="../fig/episode_04_screenshot_03_paste_into_sourcemd.png" alt="paste_into_sourcemd" class="figure mx-auto d-block"></figure><p>Click on “check source”. Now you can see automatically generated
statements including meta data of the article like author names or date
of publication. Click on “Open in QuickStatements”.</p>
<figure><img src="../fig/episode_04_screenshot_04_open_quickstatements.png" alt="open quickstatements" class="figure mx-auto d-block"></figure><p>A new window with QuickStatements will pop up. Now you’ll get an
overview of the new item and its statements. Confirm the changes by
hitting the the “run” button:</p>
<figure><img src="../fig/episode_04_screenshot_05_run_editing.png" alt="run_editing" class="figure mx-auto d-block"></figure></section><section><h2 class="section-heading" id="optional-converting-author-strings-to-author">4.4 (OPTIONAL) Converting “author strings” to “author”<a class="anchor" aria-label="anchor" href="#optional-converting-author-strings-to-author"></a>
</h2>
<hr class="half-width">
<p><a href="https://github.com/foerstner-lab/Publication_list/blob/master/Query_Strings_for_Wikidata.md" class="external-link">Find
Author Strings</a> <a href="https://author-disambiguator.toolforge.org/" class="external-link">Author
Disambiguator</a></p>
<div id="keypoints1" class="callout keypoints">
<div class="callout-square">
<i class="callout-icon" data-feather="key"></i>
</div>
<span class="callout-header">Key Points</span>
<div class="callout-inner">
<div class="callout-content">
<ul>
<li>First key point. (FIXME)</li>
</ul>
</div>
</div>
</div>
</section></section><section id="aio-05-intro_to_querying"><p>Content from <a href="05-intro_to_querying.html">Introduction to querying</a></p>
<hr>
<p>Last updated on 2024-10-01 |

        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/episodes/05-intro_to_querying.md" class="external-link">Edit this page <i aria-hidden="true" data-feather="edit"></i></a></p>
<p>Estimated time: <i aria-hidden="true" data-feather="clock"></i> 0 minutes</p>
<div class="text-end">
          <button role="button" aria-pressed="false" tabindex="0" id="expand-code" class="pull-right" data-expand="Expand All Solutions " data-collapse="Collapse All Solutions "> Expand All Solutions <i aria-hidden="true" data-feather="plus"></i></button>
        </div>
<div class="overview card">
<h2 class="card-header">Overview</h2>
<div class="row g-0">
<div class="col-md-4">
<div class="card-body">
<div class="inner">
<h3 class="card-title">Questions</h3>
<ul>
<li>What is SPARQL?</li>
<li>How to use SPARQL to query Wikidata?</li>
<li>How to use Wikidata querying tools?</li>
</ul>
</div>
</div>
</div>
<div class="col-md-8">
<div class="card-body">
<div class="inner bordered">
<h3 class="card-title">Objectives</h3>
<ul>
<li>Know what a query language is, and how SPARQL differs SQL.</li>
<li>Be able to use SPARQL to query Wikidata.</li>
<li>Potentially be able to use a tool like <a href="https://tools.wmflabs.org/tabernacle/#/" class="external-link">TABernacle</a> to edit
based on a query.</li>
<li>Have a cursory knowledge of the plethora of Wikidata querying tools
and how they can be used by librarians.</li>
<li>Know the purpose and usefulness of maintenance queries for
identifying missing information.</li>
<li>Be able to create maintenance queries.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<p>FIXME</p>
<p>There are different ways to query information in Wikidata. The
simplest way is to search for an entry in Wikidata and looking up all
information for that entry, e.g. <a href="https://www.wikidata.org/w/index.php?search=Richard+Feynman" class="external-link">search
for Richard Feynmann</a>. This search looks by default in the Q-pages as
well as the P-pages. However, we can restrict a search for a property by
only looking in the P-pages, e.g. if we want to look whether there is
property for the ISBN we can <a href="https://www.wikidata.org/w/index.php?search=isbn&amp;title=Special%3ASearch&amp;profile=advanced&amp;fulltext=1&amp;advancedSearch-current=%7B%22namespaces%22%3A%5B120%5D%7D&amp;ns120=1" class="external-link">restrict
that search to properties only</a>. Moreover, for a given entry there is
always the possibility to see other pages which links to that
(e.g. using it as an object), e.g. all pages linking to Richard Feynman:
<a href="https://www.wikidata.org/wiki/Special:WhatLinksHere/Q39246" class="external-link">https://www.wikidata.org/wiki/Special:WhatLinksHere/Q39246</a></p>
<p>That is not much different from other searches you may be familiar
with. However, the real potential of Wikidata as a huge knowledge graph,
can be experienced through more advanced querying with the Wikidata
query service where the queries have to entered in SPARQL.</p>
<p>% To discover Wikidata objects nearby there is the nearby search: %
<a href="https://www.wikidata.org/wiki/Special:Nearby" class="external-link">https://www.wikidata.org/wiki/Special:Nearby</a></p>
<section><h2 class="section-heading" id="what-is-sparql">5.1 What is SPARQL?<a class="anchor" aria-label="anchor" href="#what-is-sparql"></a>
</h2>
<hr class="half-width">
<p>SPARQL is a query language for RDF data and is a W3C recommendations
since 2008. The data has to be stored as triples where the object of one
triple can be the subject of another triple. Thus, one can think about a
huge knowledge graph, where the nodes are connected by the predicates
with other nodes. For example here we see all the information about the
book “The Meaning of It All” from Wikidata as a graph:</p>
<p><img src="../fig/Knowledge-Graph-Example-Meaning-of-it-All.png" alt="Example for the knowledge graph spanned by one Wikidata item" class="figure"> %
source: <a href="https://tinyurl.com/y267yz5q" class="external-link">http://tinyurl.com/y267yz5q</a></p>
<p>However, this is only the graph spanned by one item and its connected
entries, which then itself also have more connections, e.g. we can open
some links from the author Richard Feynman:</p>
<p><img src="../fig/Knowledge-Graph-Example-Meaning-of-it-All-More.png" alt="Example for the knowledge graph spanned by one Wikidata item and more details about Feynman" class="figure">
% click on that node in the above query</p>
<p>For querying data now in this knowledge graph with SPARQL we define
some graph patterns which we want to search. The simplest form is a
triple where we replace one of the components with a variable, which is
indicated by a string starting with a question mark:</p>
<ul>
<li>Query for the publisher:
<code>{ wd:Q7750812 wdt:P123 ?publisher . }</code>
</li>
<li>Query for the connection:
<code>{ wd:Q7750812 ?property wd:Q353060 . }</code>
</li>
<li>Query for the publications from Addison-Wesley:
<code>{ ?book wdt:P123 wd:Q353060 . }</code>
</li>
</ul></section><section><h2 class="section-heading" id="wikidata-query-service">5.2 Wikidata Query Service<a class="anchor" aria-label="anchor" href="#wikidata-query-service"></a>
</h2>
<hr class="half-width">
<p>The Wikidata query service can be found at <a href="https://query.wikidata.org/" class="external-link">https://query.wikidata.org/</a>.
There is the main window on the right to formulate your query in SPARQL.
On the left there is the query helper and at the bottom the result will
show up.</p>
<p>We will only cover here <code>SELECT</code>-statements and start by
typing</p>
<pre><code>SELECT * WHERE {

}</code></pre>
<p><em>Hint</em> It is enough to start typing “SELECT” and then use the
auto-completion with Ctrl+Space. % TODO what is this for on a Mac?</p>
<p>Inside the parenthesis you can then place the statements describing
the graph pattern you are looking for.</p>
<div id="exercise-your-first-sparql-query" class="callout discussion">
<div class="callout-square">
<i class="callout-icon" data-feather="message-circle"></i>
</div>
<span class="callout-header">Discussion</span>
<div id="exercise-your-first-sparql-query" class="callout-inner">
<h3 class="callout-title">Exercise: Your first SPARQL query</h3>
<div class="callout-content">
<p>Write your first SPARQL query for the publisher of the above
mentioned book by copying the part from above point inside a
SELECT-statement.</p>
</div>
</div>
</div>
<div id="accordionSolution1" class="accordion challenge-accordion accordion-flush">
<div class="accordion-item">
<button class="accordion-button solution-button collapsed" type="button" data-bs-toggle="collapse" data-bs-target="#collapseSolution1" aria-expanded="false" aria-controls="collapseSolution1">
  <h4 class="accordion-header" id="headingSolution1"> Show me the solution </h4>
</button>
<div id="collapseSolution1" class="accordion-collapse collapse" data-bs-parent="#accordionSolution1" aria-labelledby="headingSolution1">
<div class="accordion-body">
<pre><code>SELECT * WHERE {
   wd:Q7750812 wdt:P123 ?publisher .
}</code></pre>
</div>
</div>
</div>
</div>
<div class="section level3">
<h3 id="showing-labels-to-q-numbers">Showing labels to Q-numbers<a class="anchor" aria-label="anchor" href="#showing-labels-to-q-numbers"></a>
</h3>
</div>
<div class="section level3">
<h3 id="namespaces-and-prefixes">Namespaces and Prefixes<a class="anchor" aria-label="anchor" href="#namespaces-and-prefixes"></a>
</h3>
<p>Prefixes are short abbrevations in the Wikidata Query Service. Some
prefixes in Wikidata are: wd, wdt, p, ps, bd, etc.</p>
<p>Example:</p>
<pre><code>SELECT ?item ?itemLabel
WHERE
{
  ?item wdt:P50 wd:Q23434.
  SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}</code></pre>
<p>Items should be prefixed with wd: and properties with wdt: .</p>
<p>Namespaces in Wikidata are:</p>
<ul>
<li>Main namespace</li>
<li>Property</li>
<li>Wikidata: it is for information and discussions about Wikidata
itself. etc.</li>
</ul>
</div>
<div class="section level3">
<h3 id="more-conditions">More conditions<a class="anchor" aria-label="anchor" href="#more-conditions"></a>
</h3>
<ul>
<li>publications from Addison-Wesley vs. books from Addison-Wesley
vs. books authored by Richard Feynman from Addison-Wesley</li>
<li>LIMIT</li>
<li>ORDER</li>
<li>FILTER</li>
<li>OPTIONAL</li>
</ul>
</div>
<div class="section level3">
<h3 id="how-to-visualize-your-query">How to visualize your query<a class="anchor" aria-label="anchor" href="#how-to-visualize-your-query"></a>
</h3>
<div class="section level4">
<h4 id="manual-visualization-in-the-results-window">Manual visualization in the results window:<a class="anchor" aria-label="anchor" href="#manual-visualization-in-the-results-window"></a>
</h4>
<p>Start by opening the results window. In the results pane, click the
“Table” button and choose the type of visualization you want. This way,
you can try different ways of visualizing your data without having to
change the query code.</p>
<figure><img src="../fig/episode_5_table.jpg" alt="Wikidata Query Service results window" class="figure mx-auto d-block"></figure>
</div>
<div class="section level4">
<h4 id="automated-visualization-with-defaultview">Automated visualization with #defaultView:<a class="anchor" aria-label="anchor" href="#automated-visualization-with-defaultview"></a>
</h4>
<p>For an easy start, add the #defaultView: snippet at the beginning of
your query. This method ensures that your results will be automatically
visualized in a predefined style. This will save you time without having
to manually adjust the result window after each query. This method is
useful for queries where you already know which visualization types you
want to use.</p>
<figure><img src="../fig/episode_5_defaultview.png" alt="Extract from the SPARQL editor" class="figure mx-auto d-block"></figure>
</div>
</div>
<div class="section level3">
<h3 id="exercises">Exercises<a class="anchor" aria-label="anchor" href="#exercises"></a>
</h3>
</div>
</section><section><h2 class="section-heading" id="try-examples">5.3 Try examples<a class="anchor" aria-label="anchor" href="#try-examples"></a>
</h2>
<hr class="half-width">
<div class="section level4">
<h4 id="enough-theory-its-time-to-get-hands-on--lets-start-with-a-simple-example--literally-everyone-likes-cats-right-so-lets-search-for-them-in-the-wikidata-database-">Enough theory! it’s time to get hands-on. Let’s start with a simple
example. Literally everyone likes cats, right? So lets search for them
in the Wikidata database.<a class="anchor" aria-label="anchor" href="#enough-theory-its-time-to-get-hands-on--lets-start-with-a-simple-example--literally-everyone-likes-cats-right-so-lets-search-for-them-in-the-wikidata-database-"></a>
</h4>
<p><strong>Cats example</strong></p>
<pre><code>SELECT ?item ?itemLabel
WHERE
{
  ?item wdt:P31 wd:Q146. # Must be of a cat
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". } # Helps get the label in your language, if not, then en language
}</code></pre>
<p>Alright! So we found all the cats. But I am pretty sure that I have
seen pictures of cats somewhere in Wikipedia or Wikidata. Is there a way
to display the images in the Wikidata query service? The simple answer
is yes! Let me show you how to do it.</p>
<p><strong>Cats pictures</strong></p>
<p>In the first step, we searched for cats. It is also possible to
search for images in Wikidata, if they are available. The Wikidata query
service offers several types of visualization. The image grid is a good
way to display images.</p>
<pre><code>#defaultView:ImageGrid
#Normally, the default output is a table, but with the defaultView we can directly specify that the results should be displayed in a grid

SELECT ?item ?itemLabel ?itemPic
#Show me the item, label and the picture of it
#The result list will look like this (wd:Q123185365/senior cats/ commons:Оредеж, Железнодорожная 9, кот (cropped).jpg)

WHERE
{
  ?item wdt:P31 wd:Q146.       #The item of this search is a cat
  ?item wdt:P18 ?itemPic.      #Show me only cats with pictures. If you want to include very cats in your search, you need to place the Option{} function in front

SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
#Helps to get the label in English. If not, yours will be selected automatically
}
</code></pre>
<figure><img src="../fig/episode_5_Imagegrid.jpg" alt="Example of displaying cats in grid format" class="figure mx-auto d-block"></figure><p>Wow that was quit a lot of Code, hasnt it. lets break it down so you
understand the synatx better.</p>
<p>Lets move on to another example</p>
<p><strong>Worldmap of libraries</strong></p>
<pre><code>#defaultView:Map
#Display the results as a Map

SELECT distinct *
#Display all available geographic coordinates

WHERE {

  ?item wdt:P31 wd:Q7075;     #Define the item as a library ";"(and) define the geographic coordinates of item as ?geo
        wdt:P625 ?geo.

}</code></pre>
<figure><img src="../fig/episode_5_Map_WorldWide.png" alt="Extract from the SPARQL editor" class="figure mx-auto d-block"></figure><p><strong>Map of libraries in the USA</strong></p>
<pre><code>#defaultView:Map
#Display the results as a Map


SELECT ?itemLabel ?geo
#Display the label and the geographical coordinates of the item

WHERE {

  ?item wdt:P31 wd:Q7075.     #Define the item as a library
  ?item wdt:P625 ?geo.        #bind the geographic coordinates as ?geo
  ?item wdt:P17 ?country.     #bind the country of item as ?country

  FILTER(?country = wd:Q30)   #Use Filter to set Country to wd:Q30(U.S.A)


  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
  #Helps to get the label in English. If not, yours will be selected automatically
}</code></pre>
<figure><img src="../fig/episode_5_Map_USA.png" alt="Extract from the SPARQL editor" class="figure mx-auto d-block"></figure><p><strong>Map visualization toolbox for libraries</strong></p>
<pre><code>#defaultView:Map
#Display the results as a Map

#the main query-----------------------------------------------------------------------
SELECT DISTINCT ?itemLabel ?geo #(?itemLabel AS ?layer)
#Show the label and geographic coordinates of the item
#Remove the „#“ before „(?itemLabel AS ?layer)“ to filter the result list.


WHERE {
 ?item wdt:P31 wd:Q7075;             #Define the item as a library
       wdt:P625 ?geo.                #Get the Coordinates of the library


 #Advanced Query Options-----------------------------------------------
 #Bind the attributes you need to filter them later.
 ?item wdt:P17 ?country.             #Bind the country of item to ?country
 ?item wdt:P131 ?stateORcity.        #Bind the territory of item to ?stateORcity


 #Filter---------------------------------------------------------------
 #Select only one filter at a time to filter between country, state, and city.

 #FILTER(?country = wd:Q30)         #Set ?country to U.S.A(wd:Q30)
 #FILTER(?stateORcity = wd:Q1261)   #Set ?StateOrCity to Colorado(wd:Q1261)
 #FILTER(?stateORcity = wd:Q16554)  #Set ?StateOrCity to Denver(wd:Q16554
 #--------------------------------------------------------------------

  SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
 #Helps to get the label in English. If not, yours will be SELECTed automatically
}
</code></pre>
<figure><img src="../fig/episode_05_Map_Toolkit.jpg" alt="Extract from the SPARQL editor" class="figure mx-auto d-block"></figure><p><strong>Count of libraries per Country</strong></p>
<pre><code>#defaultView:BarChart
#Display the results as a Bar Chart

SELECT distinct ?country ?countryLabel (COUNT(?item) as ?Count)
#Show me the genre, the genre label, and count the available books as a new label ?bookCount
#The result list will look like this (wd:Q213051/Non-Fiction/252)

WHERE {
  ?item wdt:P31 wd:Q7075;  #Define the item as a library ";"(and) define the country of item as ?country
        wdt:P17 ?country.


 SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
 #Helps to get the label in English. If not, yours will be selected automatically

}
Group by ?geo ?geoLabel
#Aggregate with the group function

Order by DESC(?Count)
#Order result list by variable ?count in descending order

LIMIT 10
#Limit the shown results down to 10.
</code></pre>
<figure><img src="../fig/episode_5_Bar_Countries.png" alt="Extract from the SPARQL editor" class="figure mx-auto d-block"></figure><p><strong>Books weight by genre</strong> Number of available books
weighted by genre.</p>
<pre><code>#defaultView:BubbleChart
#Display the results as a Bubble Chart

SELECT ?genre ?genreLabel  (COUNT(?book) as ?bookCount)
#Show me the genre, the genre label, and count the available books as a new label ?bookCount
#The result list will look like this (wd:Q213051/Non-Fiction/252)

WHERE
{
  ?book wdt:P31 wd:Q571.            #Searched item is a book
  ?book wdt:P136 ?genre.            #Get the attribute genre form item

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
  #Helps to get the label in English. If not, yours will be selected automatically
}

GROUP BY ?genre ?genreLabel
#Aggregate with the group function

LIMIT 15
#Limit the shown results down to 15.</code></pre>
<figure><img src="../fig/episode_5_Bubble.png" alt="Bubblechart of books weight by genre" class="figure mx-auto d-block"></figure><p><strong>Map of NFDI Consortia in Germany</strong></p>
<pre><code>#defaultView:Map
#Display the results as a Map

SELECT DISTINCT ?affiliateLabel ?affiliatepicture ?coordinates ?NFDILabel (?NFDILabel AS ?layer)
#Show me the label, image, and coordinates of the affiliate parties.
#Show me the NFDI label as well, using the NFDILabel as a layer filter.
#The layer filter lets you choose which NFDI to display on the map.
#The result list will look like this (Deutsche Nationalbibliothek/commons:DNB.svg/NFDI4Culture/Point(8.683333333 50.131111111))

WHERE
{
  ?NFDI wdt:P31 wd:Q98270496.       #Searched item is an accepted NFDI
  ?NFDI wdt:P1416 ?affiliate.       #Get the affiliates of the accepted NFDI.
  ?affiliate wdt:P625 ?coordinates. #Get the coordinates of the affiliate parties

  OPTIONAL { ?affiliate wdt:P17 ?country }           #Get attribute country if available
  OPTIONAL { ?affiliate wdt:P154 ?affiliatepicture } #Get attribute picture if available

  FILTER(?country = wd:Q183)        #Use Filter to set country to wd:Q183(Germany)


  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]" . }
  #Helps to get the label in English. If not, yours will be selected automatically
}</code></pre>
<figure><img src="../fig/episode_05_Map.jpg" alt="Map of NFDI Consortia in Germany" class="figure mx-auto d-block"></figure><figure><img src="../fig/episode_05_Map_CloseUp.png" alt="Close up look" class="figure mx-auto d-block"></figure><p><strong>Number of participants in NFDI consortia</strong></p>
<pre><code>#Number of participants in NFDI consortia
#defaultView:BarChart
#Use the bar chart as the visualization type and give me the results immediately in the form of a bar chart.

SELECT DISTINCT ?NFDIKLabel  (COUNT(DISTINCT ?participants ) as ?participantsCount)
#Give me the unique (no double entries) names of the accepted NFDIK consortia.
#Count the participants using the COUNT function and return the number of participants as a new variable ?participantsCount.


WHERE
{
  ?NFDIK wdt:P31 wd:Q98270496.       #Give me all accepted NFDI consortia.
  ?NFDIK wdt:P710 ?participants.     #Show me the all participants of this NFDI consortium.

#Attention: Not all consortia are listed here, but only those that have an entry participants in Wikidata.
#Participants can be researchers, research institutions, universities, companies and many more.

SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]" . }
#Helps to get the label in English. If not, yours will be selected automatically
}

GROUP BY ?NFDIKLabel
#Group by NFDIK

HAVING (?participantsCount &gt; 4)
#Show me only NFDI consortia that have more than four registered participants.
</code></pre>
<figure><img src="../fig/episode_05_Barchart.png" alt="Number of participants in NFDI consortia visualized as bar chart" class="figure mx-auto d-block"></figure><p><strong>NFDI Consortia in Berlin, Germany</strong></p>
<pre><code>#defaultView:Graph
#Use the graph as the visualization type


SELECT ?affiliate ?affiliateLabel ?affiliatepicture ?NFDIK ?NFDIKLabel ?NFDIKpicture
#Give me the label and the pictures of the affiliated parties of the accepted consortia of the NFDIK.
#Give me label and pictures of accepted NFDIK consortia.


WHERE
{
  ?NFDIK wdt:P31 wd:Q98270496.       #Get me all accepted NFDI consortia.
  ?NFDIK wdt:P1416 ?affiliate.       #Get the affiliates of the accepted NFDI.
  ?affiliate wdt:P131 ?location.     #Provide me with the location of the affiliated parties.


  FILTER(?location = wd:Q64)         #Set the location to Berlin.

   OPTIONAL { ?affiliate wdt:P154 ?affiliatepicture }  #Give me the pictures of the affilated partner, if available.
   OPTIONAL { ?NFDIK wdt:P154 ?NFDIKpicture }          #Give me the pictures of the NFDI, if available.

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]" . }
  #Helps to get the label in English. If not, yours will be selected automatically

}

</code></pre>
<figure><img src="../fig/episode_5_Graph.png" alt="relationships between NFDI Consortia in Berlin, Germany" class="figure mx-auto d-block"></figure><p><strong>scholarly articles by Alex Bateman</strong></p>
<pre><code>SELECT ?item ?itemLabel ?journalLabel
WHERE
{
  ?item wdt:P31 wd:Q13442814.
  ?item wdt:P50 wd:Q18921408.
  ?item wdt:P1433 ?journal.
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
}</code></pre>
<p><strong>Russian poets</strong></p>
<pre><code>SELECT ?item ?itemLabel ?place ?placeLabel ?coord
WHERE
{
  ?item wdt:P31 wd:Q5.
  ?item wdt:P106 wd:Q49757.
  ?item wdt:P19 ?place.
  ?place wdt:P17 wd:Q159.
  ?place wdt:P625 ?coord

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
}</code></pre>
<p><strong>chemicals example</strong></p>
<pre><code>SELECT ?item ?itemLabel WHERE {

  ?item wdt:P31 wd:Q11173, wd:Q12140.

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
}</code></pre>
<pre><code>SELECT ?item ?itemLabel ?struc ?formula

WHERE {

  ?item wdt:P31 wd:Q11173, wd:Q12140.
  ?item wdt:P117 ?struc.
  ?item wdt:P274 ?formula
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }

}</code></pre>
<pre><code>SELECT ?item ?itemLabel ?formula ?mass ?struc

WHERE {

  ?item wdt:P31 wd:Q11173, wd:Q12140.
  ?item wdt:P117 ?struc.
  ?item wdt:P274 ?formula.
  ?item wdt:P2067 ?mass.
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }

}

ORDER BY DESC(?mass)
LIMIT 10</code></pre>
<p><strong>People born in Berlin filtered by year 1970</strong></p>
<pre><code>SELECT ?item ?itemLabel ?dob
WHERE
{
  ?item wdt:P31 wd:Q5.
  ?item wdt:P19 wd:Q64.
  ?item wdt:P569 ?dob.

  FILTER(YEAR(?dob) = 1970)

  SERVICE wikibase:label { bd:serviceParam wikibase:language "en,[AUTO_LANGUAGE]". }
}</code></pre>
</div>
</section><section><h2 class="section-heading" id="more-advanced-queries">5.4 More Advanced queries<a class="anchor" aria-label="anchor" href="#more-advanced-queries"></a>
</h2>
<hr class="half-width">
<p>further links</p>
<pre><code>https://commons.wikimedia.org/wiki/File:Wikidata_Query_Service_in_Brief.pdf
https://www.uni-mannheim.de/media/Einrichtungen/dws/Files_Teaching/Semantic_Web_Technologies/SWT05-SPARQL-v1.pdf
https://www.wikidata.org/wiki/Wikidata:SPARQL_tutorial</code></pre>
<div id="keypoints1" class="callout keypoints">
<div class="callout-square">
<i class="callout-icon" data-feather="key"></i>
</div>
<span class="callout-header">Key Points</span>
<div class="callout-inner">
<div class="callout-content">
<ul>
<li>First key point. (FIXME)</li>
</ul>
</div>
</div>
</div>
</section></section><section id="aio-06-bulk_actions"><p>Content from <a href="06-bulk_actions.html">Advanced bulk updating, bots</a></p>
<hr>
<p>Last updated on 2023-04-24 |

        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/episodes/06-bulk_actions.md" class="external-link">Edit this page <i aria-hidden="true" data-feather="edit"></i></a></p>
<p>Estimated time: <i aria-hidden="true" data-feather="clock"></i> 0 minutes</p>
<div class="text-end">
          <button role="button" aria-pressed="false" tabindex="0" id="expand-code" class="pull-right" data-expand="Expand All Solutions " data-collapse="Collapse All Solutions "> Expand All Solutions <i aria-hidden="true" data-feather="plus"></i></button>
        </div>
<div class="overview card">
<h2 class="card-header">Overview</h2>
<div class="row g-0">
<div class="col-md-4">
<div class="card-body">
<div class="inner">
<h3 class="card-title">Questions</h3>
<ul>
<li>How do you bulk upload to Wikidata?</li>
</ul>
</div>
</div>
</div>
<div class="col-md-8">
<div class="card-body">
<div class="inner bordered">
<h3 class="card-title">Objectives</h3>
<ul>
<li>Know how to run a bulk import into Wikidata.</li>
<li>Be able to create items and/or claims using quickstatements.</li>
<li>Be familiar with the tools used for bulk edits and imports.</li>
<li>Be able to articulate how bulk import tools can apply to cataloging
and digital science/archive projects.</li>
<li>Know how to write effective queries in terms of performance. (TODO:
may refine or improve or delete)</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<p>FIXME</p>
<section><h2 class="section-heading" id="learning-outcomes">Learning outcomes<a class="anchor" aria-label="anchor" href="#learning-outcomes"></a>
</h2>
<hr class="half-width">
<ul>
<li><p>Understand how to run a bulk import into Wikidata</p></li>
<li><p>practice using quickstatements? (module 3 already includes
QuickStatements)</p></li>
<li><p>Be familiar with the tools used for bulk edits and
imports</p></li>
<li><p>Tools for bulk upload: - Quick statements (<a href="https://www.wikidata.org/wiki/Help:QuickStatements" class="external-link">https://www.wikidata.org/wiki/Help:QuickStatements</a>)</p></li>
<li><p>Connect bulk import possibilities to cataloging and digital
science/archive projects?</p></li>
<li><p>Understand how to write a good queries in terms of
performance</p></li>
<li><h2 id="bulk-uploadsharvests-lead-to-openrefine-modules">6.1 Bulk
uploads/harvests (lead to OpenRefine modules)</h2></li>
</ul>
<p>Test test test</p>
</section><section><h2 class="section-heading" id="bulk-edits">6.2 Bulk edits<a class="anchor" aria-label="anchor" href="#bulk-edits"></a>
</h2>
<hr class="half-width"></section><section><h2 class="section-heading" id="bulk-creationharvesting">6.3 Bulk creation/harvesting<a class="anchor" aria-label="anchor" href="#bulk-creationharvesting"></a>
</h2>
<hr class="half-width"></section><section><h2 class="section-heading" id="performance">6.4 Performance<a class="anchor" aria-label="anchor" href="#performance"></a>
</h2>
<hr class="half-width">
<ul>
<li><a href="https://www.wikidata.org/wiki/Wikidata:SPARQL_query_service/query_optimization" class="external-link">https://www.wikidata.org/wiki/Wikidata:SPARQL_query_service/query_optimization</a></li>
</ul>
<div id="keypoints1" class="callout keypoints">
<div class="callout-square">
<i class="callout-icon" data-feather="key"></i>
</div>
<span class="callout-header">Key Points</span>
<div class="callout-inner">
<div class="callout-content">
<ul>
<li>First key point. (FIXME)</li>
</ul>
</div>
</div>
</div>
</section></section>
</div>
    </main>
</div>
<!-- END  : inst/pkgdown/templates/content-extra.html -->

      </div>
<!--/div.row-->
      		<footer class="row footer mx-md-3"><hr>
<div class="col-md-6">
        <p>This lesson is subject to the <a href="CODE_OF_CONDUCT.html">Code of Conduct</a></p>
        <p>

        <a href="https://github.com/librarycarpentry/lc-wikidata/edit/main/README.md" class="external-link">Edit on GitHub</a>

	
        | <a href="https://github.com/librarycarpentry/lc-wikidata/blob/main/CONTRIBUTING.md" class="external-link">Contributing</a>
        | <a href="https://github.com/librarycarpentry/lc-wikidata/" class="external-link">Source</a></p>
				<p><a href="https://github.com/librarycarpentry/lc-wikidata/blob/main/CITATION" class="external-link">Cite</a> | <a href="mailto:team@carpentries.org">Contact</a> | <a href="https://carpentries.org/about/" class="external-link">About</a></p>
			</div>
			<div class="col-md-6">

        <p>Materials licensed under <a href="LICENSE.html">CC-BY 4.0</a> by the authors</p>

        <p>Template licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/" class="external-link">CC-BY 4.0</a> by <a href="https://carpentries.org/" class="external-link">The Carpentries</a></p>
        <p>Built with <a href="https://github.com/carpentries/sandpaper/tree/0.17.1" class="external-link">sandpaper (0.17.1)</a>, <a href="https://github.com/carpentries/pegboard/tree/0.7.9" class="external-link">pegboard (0.7.9)</a>, and <a href="https://github.com/carpentries/varnish/tree/1.0.7" class="external-link">varnish (1.0.7)</a></p>
			</div>
		</footer>
</div> <!-- / div.container -->
	<div id="to-top">
		<a href="#top">
      <i class="search-icon" data-feather="arrow-up" role="img" aria-label="Back To Top"></i><br><!-- <span class="d-none d-sm-none d-md-none d-lg-none d-xl-block">Back</span> To Top --><span class="d-none d-sm-none d-md-none d-lg-none d-xl-block">Back</span> To Top
		</a>
	</div>
  <script type="application/ld+json">
    {
  "@context": "https://schema.org",
  "@type": "LearningResource",
  "@id": "https://librarycarpentry.github.io/lc-wikidata/instructor/aio.html",
  "inLanguage": "en",
  "dct:conformsTo": "https://bioschemas.org/profiles/LearningResource/1.0-RELEASE",
  "description": "A Carpentries Lesson teaching foundational data and coding skills to researchers worldwide",
  "keywords": "software, data, lesson, The Carpentries",
  "name": "All in One View",
  "creativeWorkStatus": "active",
  "url": "https://librarycarpentry.github.io/lc-wikidata/instructor/aio.html",
  "identifier": "https://librarycarpentry.github.io/lc-wikidata/instructor/aio.html",
  "dateCreated": "2018-09-17",
  "dateModified": "2025-11-04",
  "datePublished": "2025-11-04"
}

  </script><script>
		feather.replace();
	</script><!-- Matomo --><script>
          var _paq = window._paq = window._paq || [];
          /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
          _paq.push(["setDocumentTitle", document.domain + "/" + document.title]);
          _paq.push(["setDomains", ["*.lessons.carpentries.org","*.datacarpentry.github.io","*.datacarpentry.org","*.librarycarpentry.github.io","*.librarycarpentry.org","*.swcarpentry.github.io", "*.carpentries.github.io"]]);
          _paq.push(["setDoNotTrack", true]);
          _paq.push(["disableCookies"]);
          _paq.push(["trackPageView"]);
          _paq.push(["enableLinkTracking"]);
          (function() {
              var u="https://matomo.carpentries.org/";
              _paq.push(["setTrackerUrl", u+"matomo.php"]);
              _paq.push(["setSiteId", "1"]);
              var d=document, g=d.createElement("script"), s=d.getElementsByTagName("script")[0];
              g.async=true; g.src="https://matomo.carpentries.org/matomo.js"; s.parentNode.insertBefore(g,s);
          })();
        </script><!-- End Matomo Code -->
</body>
</html><!-- END:   inst/pkgdown/templates/layout.html-->

